// function mymap(){

let xon = [
    {name:112.17,value:39.1,pass:"神池",phone:131123456789,pepmath:20,},

    {name:111.9,value:38.37,pass:"静乐",phone:132123456789,pepmath:30,},
    
    {name:112.709303,value:38.448943,pass:"忻州",phone:133123456789,pepmath:35,},
    
    {name:113.01,value:38.99,pass:"代县",phone:134123456789,pepmath:40,},
    
    {name:112.7,value:38.73,pass:"原平",phone:134123456789,pepmath:40},
    
    {name:111.17,value:39.38,pass:"河曲",phone:135123456789,pepmath:45,},
    
    {name:112.95,value:38.5,pass:"定襄",phone:136123456789,pepmath:50,},
    
    {name:111.58,value:38.7, pass:"岢岚",phone:137123456789,pepmath:50,},
    
    {name:113.28,value:39.2,pass:"繁峙",phone:138123456789,pepmath:55,},
    
    {name:112.28,value:39,pass:"宁武",phone:139123456789,pepmath:60,},
    
    {name:111.105324,value:39.085888,pass:"保德",phone:139123456789,pepmath:65,},
    
    {name:111.47,value:39.45,pass:"偏关",phone:139123456789,pepmath:45, },
    
    {name:113.32,value:38.72,pass:"五台",phone:139123456789,pepmath:70,},
    
    {name:111.82,value:38.93,pass:"五寨",phone:139123456789,pepmath:30,}
    
]

let aq=[
    {li:"代县 2018-03-27 15时13分02秒 安全煤矿**********"},
    {li:"繁峙县 2018-03-27 15时13分02秒 安全煤矿**********"},
    {li:"静乐县 2018-03-27 15时13分02秒 安全煤矿**********"},
    {li:"定襄县 2018-03-27 15时13分02秒 安全煤矿**********"},
    {li:"五台县 2018-03-27 15时13分02秒 安全煤矿**********"},
    {li:"神池县 2018-03-27 15时13分02秒 安全煤矿**********"},
    {li:"五寨县 2018-03-27 15时13分02秒 安全煤矿**********"},
    {li:"岢岚县 2018-03-27 15时13分02秒 安全煤矿**********"},
    {li:"偏关县 2018-03-27 15时13分02秒 安全煤矿**********"},
    {li:"河曲县 2018-03-27 15时13分02秒 安全煤矿**********"},
    {li:"保德县 2018-03-27 15时13分02秒 安全煤矿**********"},
    {li:"宁武县 2018-03-27 15时13分02秒 安全煤矿**********"},
    {li:"原平市 2018-03-27 15时13分02秒 安全煤矿**********"}
];
let ry=[
    {li:"代县 2018-03-27 15时13分02秒 安全煤矿**********"},
    {li:"繁峙县 2018-03-27 15时13分02秒 安全煤矿**********"},
    {li:"静乐县 2018-03-27 15时13分02秒 安全煤矿**********"},
    {li:"定襄县 2018-03-27 15时13分02秒 安全煤矿**********"},
    {li:"五台县 2018-03-27 15时13分02秒 安全煤矿**********"},
    {li:"神池县 2018-03-27 15时13分02秒 安全煤矿**********"},
    {li:"五寨县 2018-03-27 15时13分02秒 安全煤矿**********"},
    {li:"岢岚县 2018-03-27 15时13分02秒 安全煤矿**********"},
    {li:"偏关县 2018-03-27 15时13分02秒 安全煤矿**********"},
    {li:"河曲县 2018-03-27 15时13分02秒 安全煤矿**********"},
    {li:"保德县 2018-03-27 15时13分02秒 安全煤矿**********"},
    {li:"宁武县 2018-03-27 15时13分02秒 安全煤矿**********"},
    {li:"原平市 2018-03-27 15时13分02秒 安全煤矿**********"}
];
let cl=[
    {li:"代县 2018-03-27 15时13分02秒 安全煤矿**********"},
    {li:"繁峙县 2018-03-27 15时13分02秒 安全煤矿**********"},
    {li:"静乐县 2018-03-27 15时13分02秒 安全煤矿**********"},
    {li:"定襄县 2018-03-27 15时13分02秒 安全煤矿**********"},
    {li:"五台县 2018-03-27 15时13分02秒 安全煤矿**********"},
    {li:"神池县 2018-03-27 15时13分02秒 安全煤矿**********"},
    {li:"五寨县 2018-03-27 15时13分02秒 安全煤矿**********"},
    {li:"岢岚县 2018-03-27 15时13分02秒 安全煤矿**********"},
    {li:"偏关县 2018-03-27 15时13分02秒 安全煤矿**********"},
    {li:"河曲县 2018-03-27 15时13分02秒 安全煤矿**********"},
    {li:"保德县 2018-03-27 15时13分02秒 安全煤矿**********"},
    {li:"宁武县 2018-03-27 15时13分02秒 安全煤矿**********"},
    {li:"原平市 2018-03-27 15时13分02秒 安全煤矿**********"}
];


let mkzb=[
    {lnt:113.289414,lat:40.027425,name:"国电电力发展股份有限公司大同第二发电厂"},
    {lnt:113.181804,lat:39.97935,name:"山西漳电大唐热电有限公司"},
    
    {lnt:113.175474,lat:40.066434,name:"拖皮集运站"},
    {lnt:113.298704,lat:40.166043,name:"大同市古店发煤站"},
    
    {lnt:113.222044,lat:39.953744,name:"大同市南郊区集运站1"},
    {lnt:113.222044,lat:39.953744,name:"大同市南郊区集运站2"},
    
    
    {lnt:113.235752,lat:39.977339,name:"同煤广发化学工业公司"},
    {lnt:113.162465,lat:39.987985,name:"大同煤矿集团有限责任公司煤气厂"},
    
    {lnt:113.235983,lat:40.002275,name:"大同市晋海煤业有限公司"},
    
    {lnt:113.276878,lat:40.171519,name:"大同市亿新煤业精选有限责任公司"},
    {lnt:113.177104,lat:39.922322,name:"大同市南郊区顺威洗煤厂"},
    
    {lnt:114.389198,lat:39.840065,name:"广灵县吉隆煤炭销售有限公司"},
    {lnt:114.389389,lat:39.841239,name:"广灵县明广煤场"},
    
    {lnt:113.814964,lat:39.779241,name:"浑源县亿兆选煤有限公司"},
    {lnt:113.649538,lat:39.669278,name:"浑源县北岳煤炭经销有限公司"},
    
    {lnt:113.398564,lat:40.060396,name:"大同开发区煤炭运销有限责任公司"},
    
    {lnt:114.289059,lat:39.477545,name:"灵丘县国新能源煤炭有限公司"},
    
    {lnt:113.217598,lat:39.976719,name:"大同市南郊区落里湾村汇源洗煤厂"},
    {lnt:113.218667,lat:39.979745,name:"大同市南郊区鸿福煤业有限公司"},
    
    {lnt:114.101352,lat:40.41211,name:"山西煤炭运销集团大同有限公司天阳煤炭储配中心"},
    
    {lnt:113.942026,lat:39.788979,name:"广灵县"},
    {lnt:113.401575,lat:40.12321,name:"大同县"},
    
    {lnt:113.071075,lat:40.185691,name:"大同市宏图煤炭能源有限公司"},
    {lnt:113.021439,lat:40.142282,name:"大同市新荣区泉鑫实业有限公司"},
    
    {lnt:112.818742,lat:40.049747,name:"山西安达源煤炭运销有限公司"},
    {lnt:112.935454,lat:40.094217,name:"左云县东众精煤有限公司"},
    
    {lnt:113.002651,lat:40.117179,name:"山西大同矿区安盛欣煤业有限公司"},
    
    {lnt:113.624469,lat:39.754627,name:"山西浑源恒山阳光煤业有限责任公司"},
    
    {lnt:113.624469,lat:39.754627,name:"山西浑源恒山阳光煤业有限责任公司"},
    
    {lnt:113.075867,lat:39.92242,name:"国投大同能源有限责任公司塔山煤矿铁路专用线"},
    {lnt:113.044705,lat:40.127757,name:"山西煤炭运销集团黄土坡煤业有限责任公司铁路专用线"},
    
    {lnt:113.765285,lat:39.85017,name:"浑源县露天矿1"},
    {lnt:113.808721,lat:39.827904,name:"浑源县露天矿2"},
    
    {lnt:112.957313,lat:40.054211,name:"山西煤炭运销集团和尚嘴煤业有限公司"},
    {lnt:113.027828,lat:39.957358,name:"山西煤炭运销集团七峰山煤业有限公司"},
    
    {lnt:113.130334,lat:40.168508,name:"山西中新甘庄煤业有限责任公司"},
    {lnt:113.020404,lat:40.174026,name:"山西中新唐山沟煤业有限责任公司"},
    
    {lnt:112.906492,lat:40.080158,name:"山西煤炭运销集团天兴煤业有限责任公司"},
    {lnt:112.792385,lat:39.936153,name:"山西煤炭运销集团下湾煤业有限责任公司"},
    
    {lnt:113.417702,lat:40.041216,name:"山西祥成实业有限公司"},
    {lnt:113.422714,lat:40.038314,name:"大同永富煤炭销售有限公司"},
    {
        "lnt": "112.517915", 
        "name": "山西和瑞新能源开发有限公司", 
        "lat": "35.667716"
    }, 
    {
        "lnt": "112.731502", 
        "name": "山西金驹煤电化股份有限公司成庄热电分公司", 
        "lat": "35.614063"
    }, 
    {
        "lnt": "112.924579", 
        "name": "国投晋城热电有限公司", 
        "lat": "35.46292"
    }, 
    {
        "lnt": "112.575782", 
        "name": "阳城国际发电有限责任公司", 
        "lat": "35.465999"
    }, 
    {
        "lnt": "112.885895", 
        "name": "山西金驹煤电化股份有限公司王台热电分公司", 
        "lat": "35.561218"
    },
    {
        "lnt": "112.873094", 
        "name": "高平市南陈运销有限公司", 
        "lat": "35.740609"
    }, 
    {
        "lnt": "112.782229", 
        "name": "山西兰花能源集运有限公司（唐安战略装车点）专用铁路", 
        "lat": "35.722455"
    }, 
    {
        "lnt": "112.98168", 
        "name": "晋城市米山集煤站", 
        "lat": "35.768528"
    }, 
    {
        "lnt": "112.899687", 
        "name": "晋城市南陈铺集煤站", 
        "lat": "35.746335"
    }, 
    {
        "lnt": "112.894145", 
        "name": "高平市南王庄发煤站", 
        "lat": "35.812203"
    }, 
    {
        "lnt": "112.869347", 
        "name": "山西高平西阳村东九道发煤站", 
        "lat": "35.874284"
    }, 
    {
        "lnt": "112.51416", 
        "name": "嘉峰货场煤站", 
        "lat": "36.582953"
    }, 
    {
        "lnt": "112.529571", 
        "name": "晋城市武安集运站", 
        "lat": "35.564877"
    }, 
    {
        "lnt": "112.506645", 
        "name": "端氏集煤站", 
        "lat": "35.653383"
    }, 
    {
        "lnt": "112.156012", 
        "name": "山西沁水煤炭集运站", 
        "lat": "35.681643"
    }, 
    {
        "lnt": "112.891531", 
        "name": "泽州县北板桥发煤站", 
        "lat": "35.643264"
    }, 
    {
        "lnt": "112.894981", 
        "name": "晋城市武庄集运站", 
        "lat": "35.515695"
    }, 
    {
        "lnt": "112.927169", 
        "name": "晋城市泊南集运站", 
        "lat": "35.582995"
    }, 
    {
        "lnt": "112.821136", 
        "name": "泽州县青杨掌集运站", 
        "lat": "35.444885"
    }, 
    {
        "lnt": "112.832306", 
        "name": "泽州县东阳集运站", 
        "lat": "35.446108"
    }, 
    {
        "lnt": "112.491264", 
        "name": "阳城县八甲口综合集运站", 
        "lat": "35.492064"
    }, 
    {
        "lnt": "112.489185", 
        "name": "阳城县上孔发煤站", 
        "lat": "35.496109"
    },
    {
        "lnt": "112.964293", 
        "name": "高平市三甲炼焦有限责任公司", 
        "lat": "35.862127"
    }, 
    {
        "lnt": "112.802628", 
        "name": "山西兴高能源股份有限公司", 
        "lat": "35.727619"
    }, 
    {
        "lnt": "111.965333", 
        "name": "山西明源集团沁泽焦化有限公司", 
        "lat": "35.576144"
    },
     {
        "lnt": "112.837547", 
        "name": "山西晋丰煤化工有限责任公司", 
        "lat": "35.761953"
    }, 
    {
        "lnt": "112.894636", 
        "name": "山西晋煤天源化工有限公司", 
        "lat": "35.758571"
    }, 
    {
        "lnt": "112.596938", 
        "name": "山西金象煤化工有限责任公司", 
        "lat": "35.46764"
    }, 
    {
        "lnt": "112.635364", 
        "name": "山西晋煤华昱煤化工有限责任公司", 
        "lat": "35.462285"
    }, 
    {
        "lnt": "112.934887", 
        "name": "晋城煤业集团天溪煤制油分公司", 
        "lat": "35.506128"
    },
    {
        "lnt": "111.978748", 
        "name": "山西三佳新能源科技集团有限公司炭电极分公司", 
        "lat": "37.094217"
    }, 
    {
        "lnt": "111.97378", 
        "name": "山西安泰集团股份有限公司二电厂", 
        "lat": "37.099079"
    }, 
    {
        "lnt": "111.903309", 
        "name": "山西天石电力有限公司", 
        "lat": "36.908465"
    }, 
    {
        "lnt": "111.79531", 
        "name": "山西中凯集团灵石热电有限公司", 
        "lat": "36.863184"
    }, 
    {
        "lnt": "112.287788", 
        "name": "山西耀光煤电有限责任公司", 
        "lat": "37.219824"
    }, 
    {
        "lnt": "112.311617", 
        "name": "山西顺发热电有限公司", 
        "lat": "37.384436"
    }, 
    {
        "lnt": "113.650561", 
        "name": "国投昔阳能源有限责任公司安平发电厂", 
        "lat": "37.641899"
    }, 
    {
        "lnt": "112.954313", 
        "name": "山西华能榆社电力有限公司", 
        "lat": "36.97611"
    }, 
    {
        "lnt": "112.958421", 
        "name": "山西榆社化工股份有限公司", 
        "lat": "37.046592"
    }, 
    {
        "lnt": "113.354113", 
        "name": "华能左权煤电有限责任公司", 
        "lat": "37.049564"
    }, 
    {
        "lnt": "113.470203", 
        "name": "左权县双玉电化有限责任公司", 
        "lat": "36.848524"
    }, 
    {
        "lnt": "112.747335", 
        "name": "国电榆次热电有限公司", 
        "lat": "37.62776"
    }, 
    {
        "lnt": "112.664167", 
        "name": "榆次恒能热电厂", 
        "lat": "37.674167"
    }, 
    {
        "lnt": "112.720264", 
        "name": "山西瑞光热电有限责任公司", 
        "lat": "37.784664"
    }, 
    {
        "lnt": "113.224679", 
        "name": "寿阳博奇电厂（阳煤集团寿阳明泰发电有限公司）", 
        "lat": "37.984014"
    },
    {
        "lnt": "111.982398", 
        "name": "介休市工业用户", 
        "lat": "37.117873"
    }, 
    {
        "lnt": "111.352846", 
        "name": "灵石县工业用户", 
        "lat": "36.42571"
    }, 
    {
        "lnt": "112.589525", 
        "name": "太谷县工业用户", 
        "lat": "37.400282"
    }, 
    {
        "lnt": "113.354396", 
        "name": "左权县工业用户", 
        "lat": "37.069726"
    },
    {
        "lnt": "111.887497", 
        "name": "介休市劳服金达煤焦储运有限公司专用线", 
        "lat": "37.009833"
    }, 
    {
        "lnt": "111.934225", 
        "name": "介休市南铁物资仓储有限公司", 
        "lat": "37.025119"
    }, 
    {
        "lnt": "111.894522", 
        "name": "介休货场", 
        "lat": "37.012469"
    }, 
    {
        "lnt": "111.929053", 
        "name": "山西煤炭运销集团晋中介休有限公司发煤站", 
        "lat": "37.022241"
    }, 
    {
        "lnt": "111.937489", 
        "name": "山西碳素厂专用线", 
        "lat": "37.030188"
    }, 
    {
        "lnt": "111.984452", 
        "name": "山西安泰集团股份有限公司专用线", 
        "lat": "37.073649"
    }, 
    {
        "lnt": "112.029466", 
        "name": "山西焦炭集团益通铁路运销股份有限公司", 
        "lat": "37.116785"
    }, 
    {
        "lnt": "111.91335", 
        "name": "介休市发达物贸有限公司介休分公司", 
        "lat": "37.016159"
    }, 
    {
        "lnt": "111.991967", 
        "name": "山西茂盛煤化集团有限公司铁路专用线", 
        "lat": "37.077186"
    }, 
    {
        "lnt": "111.662863", 
        "name": "山西晋煤实业股份有限公司", 
        "lat": "36.757988"
    }, 
    {
        "lnt": "111.667648", 
        "name": "灵石南关煤焦发运站", 
        "lat": "36.694899"
    }, 
    {
        "lnt": "111.682705", 
        "name": "天行煤焦铁路专线", 
        "lat": "36.71597"
    }, 
    {
        "lnt": "111.670789", 
        "name": "灵石县紫嵘铸管有限责任公司铸管厂专用线", 
        "lat": "36.699823"
    }, 
    {
        "lnt": "111.787175", 
        "name": "两渡煤焦集运站", 
        "lat": "36.944488"
    }, 
    {
        "lnt": "111.75373", 
        "name": "山西灵石通宇实业有限公司玉成发运站专用线", 
        "lat": "36.81811"
    }, 
    {
        "lnt": "111.725403", 
        "name": "灵石县荣辉矿业有限公司", 
        "lat": "36.823859"
    }, 
    {
        "lnt": "111.761842", 
        "name": "晋中市灵石煤矿有限公司专用线1、3道", 
        "lat": "36.872136"
    }, 
    {
        "lnt": "111.762195", 
        "name": "灵石站内10道", 
        "lat": "36.867989"
    }, 
    {
        "lnt": "111.785881", 
        "name": "山西中宝富源煤炭运销有限公司专用线2", 
        "lat": "36.936956"
    }, 
    {
        "lnt": "111.788925", 
        "name": "山西中宝富源煤炭运销有限公司专用线", 
        "lat": "36.943783"
    }, 
    {
        "lnt": "111.758691", 
        "name": "山西省晋中灵石煤矿专用线", 
        "lat": "36.887417"
    }, 
    {
        "lnt": "111.734904", 
        "name": "烟台开发区临汾铁路贸易有限责任公司专用线", 
        "lat": "36.824193"
    }, 
    {
        "lnt": "112.13314", 
        "name": "山西煤运明隆煤炭销售有限公司", 
        "lat": "37.187948"
    }, 
    {
        "lnt": "113.655743", 
        "name": "山西煤炭运销集团晋中昔阳有限公司", 
        "lat": "37.633138"
    }, 
    {
        "lnt": "113.667631", 
        "name": "晋中市阳涉煤炭运销有限公司昔阳发运站", 
        "lat": "37.628635"
    }, 
    {
        "lnt": "113.455048", 
        "name": "晋中市阳涉煤炭运销有限公司寒王发运站", 
        "lat": "37.220532"
    }, 
    {
        "lnt": "113.417135", 
        "name": "左权县鸿泰发运有限公司", 
        "lat": "37.13958"
    }, 
    {
        "lnt": "113.397436", 
        "name": "左权县聚晟能源有限公司", 
        "lat": "37.067876"
    }, 
    {
        "lnt": "113.62193", 
        "name": "晋中阳涉煤炭运销有限公司泊里发运站", 
        "lat": "37.390578"
    }, 
    {
        "lnt": "113.556785", 
        "name": "山西晶石天路煤炭运销有限公司", 
        "lat": "37.314208"
    }, 
    {
        "lnt": "113.545956", 
        "name": "和顺会里集运站", 
        "lat": "37.309938"
    }, 
    {
        "lnt": "113.157353", 
        "name": "山西中胜统配煤炭销售有限公司", 
        "lat": "37.964709"
    }, 
    {
        "lnt": "113.197398", 
        "name": "寿阳中胜伟业东湾煤矿铁路专用线", 
        "lat": "38.005246"
    }, 
    {
        "lnt": "113.113919", 
        "name": "寿阳县草沟煤站", 
        "lat": "37.908513"
    }, 
    {
        "lnt": "113.136787", 
        "name": "寿阳先行煤炭经营有限公司", 
        "lat": "37.901893"
    }, 
    {
        "lnt": "111.778923", 
        "name": "中宝富源专用线", 
        "lat": "36.92872519"
    }, 
    {
        "lnt": "111.663449", 
        "name": "富家滩发煤站", 
        "lat": "36.762215"
    }, 
    {
        "lnt": "111.740962", 
        "name": "冷泉煤炭集运站", 
        "lat": "36.8209256"
    }, 
    {
        "lnt": "111.892015", 
        "name": "山西焦煤汾西矿业洗煤厂集运站", 
        "lat": "37.020895"
    },
    {
        "lnt": "112.066503", 
        "name": "G5京昆高速张兰高速口", 
        "lat": "37.106778"
    }, 
    {
        "lnt": "112.080631", 
        "name": "国道108与省66高速张兰北收费站互通枢纽", 
        "lat": "37.152205"
    }, 
    {
        "lnt": "112.055998", 
        "name": "国道108与省道223穆家堡收费站交汇处", 
        "lat": "37.134819"
    }, 
    {
        "lnt": "112.068599", 
        "name": "省道221与县道379交叉口", 
        "lat": "37.133431"
    }, 
    {
        "lnt": "111.838213", 
        "name": "国道108与省道223交叉口", 
        "lat": "37.0113"
    }, 
    {
        "lnt": "111.846366", 
        "name": "国道108与省道243交叉口", 
        "lat": "37.035962"
    }, 
    {
        "lnt": "111.839121", 
        "name": "国道108与省道223交叉口", 
        "lat": "37.01553"
    }, 
    {
        "lnt": "111.891096", 
        "name": "省道223，省道221与县道377交叉口", 
        "lat": "37.004464"
    }, 
    {
        "lnt": "111.949849", 
        "name": "县道377", 
        "lat": "37.028408"
    }, 
    {
        "lnt": "111.947778", 
        "name": "县道377与省道223交叉口", 
        "lat": "37.031634"
    }, 
    {
        "lnt": "111.946329", 
        "name": "省道223与省道221交叉口", 
        "lat": "37.037139"
    }, 
    {
        "lnt": "111.945204", 
        "name": "G5京昆高速介休市高速口", 
        "lat": "37.020141"
    }, 
    {
        "lnt": "111.67184", 
        "name": "三湾口交通枢纽", 
        "lat": "36.780057"
    }, 
    {
        "lnt": "111.695068", 
        "name": "夏门交通枢纽", 
        "lat": "36.814603"
    }, 
    {
        "lnt": "111.795818", 
        "name": "G5（京昆高速）晋中市灵石县仁义出口", 
        "lat": "36.74097"
    }, 
    {
        "lnt": "111.673673", 
        "name": "国道108南关路口", 
        "lat": "36.711096"
    }, 
    {
        "lnt": "111.887743", 
        "name": "东夏线与G5高速灵石出口交汇处", 
        "lat": "36.890034"
    }, 
    {
        "lnt": "111.740287", 
        "name": "灵石县两渡镇去往英武乡交通枢纽", 
        "lat": "36.909953"
    }, 
    {
        "lnt": "112.145361", 
        "name": "S221-S222-G108环形枢纽", 
        "lat": "37.192267"
    }, 
    {
        "lnt": "112.438146", 
        "name": "祁县东观镇G108与G208交叉口", 
        "lat": "37.38486"
    }, 
    {
        "lnt": "112.276583", 
        "name": "G5京昆高速祁县城赵出口", 
        "lat": "37.364464"
    }, 
    {
        "lnt": "112.440404", 
        "name": "榆祁高速东观出口", 
        "lat": "37.454021"
    }, 
    {
        "lnt": "113.454785", 
        "name": "左权黎城涉县交叉口", 
        "lat": "36.848956"
    }, 
    {
        "lnt": "113.330858", 
        "name": "左权黎城武乡交叉口", 
        "lat": "36.955414"
    },
    {
        "lnt": "112.043816", 
        "name": "山西省焦炭集团益隆焦化股份有限公司", 
        "lat": "37.141013"
    }, 
    {
        "lnt": "112.021511", 
        "name": "山西省焦炭集团益兴焦化股份有限公司", 
        "lat": "37.120244"
    }, 
    {
        "lnt": "111.996843", 
        "name": "山西茂盛煤化集团有限公司", 
        "lat": "37.074981"
    }, 
    {
        "lnt": "111.970404", 
        "name": "山西介休三盛焦化有限公司", 
        "lat": "37.082398"
    }, 
    {
        "lnt": "111.794258", 
        "name": "山西介休大佛寺煤业有限公司", 
        "lat": "36.96506"
    }, 
    {
        "lnt": "112.016322", 
        "name": "山西省介休市路鑫煤炭气化有限公司", 
        "lat": "37.12022"
    }, 
    {
        "lnt": "112.014313", 
        "name": "山西省介休市路鑫煤炭气化有限公司焦厂", 
        "lat": "37.116396"
    }, 
    {
        "lnt": "111.948341", 
        "name": "山西金昌煤炭气化有限公司", 
        "lat": "37.046996"
    }, 
    {
        "lnt": "111.983146", 
        "name": "山西三佳新能源科技集团有限公司", 
        "lat": "37.065417"
    }, 
    {
        "lnt": "111.969366", 
        "name": "山西宏安焦化科技有限公司", 
        "lat": "37.100383"
    }, 
    {
        "lnt": "111.978736", 
        "name": "山西安泰集团股份有限公司", 
        "lat": "37.076815"
    }, 
    {
        "lnt": "111.82349", 
        "name": "山西天星煤气化有限公司", 
        "lat": "36.856513"
    }, 
    {
        "lnt": "111.64729", 
        "name": "灵石县中煤九鑫焦化有限责任公司", 
        "lat": "36.807838"
    }, 
    {
        "lnt": "111.703746", 
        "name": "山西聚源煤化有限公司", 
        "lat": "36.713938"
    }, 
    {
        "lnt": "111.745524", 
        "name": "山西聚丰能源有限公司", 
        "lat": "36.725858"
    }, 
    {
        "lnt": "112.576238", 
        "name": "山西太谷恒达煤气化有限公司", 
        "lat": "37.404057"
    }, 
    {
        "lnt": "112.721862", 
        "name": "山西神龙能源焦化有限责任公司", 
        "lat": "37.602222"
    },
     {
        "lnt": "113.476357", 
        "name": "山西和顺天池能源有限责任公司", 
        "lat": "37.236982"
    }, 
    {
        "lnt": "113.636309", 
        "name": "山西和顺正邦良顺煤业有限公司", 
        "lat": "37.411138"
    }, 
    {
        "lnt": "113.658374", 
        "name": "山西和顺正邦隆鑫煤业有限公司", 
        "lat": "37.438985"
    }, 
    {
        "lnt": "113.608518", 
        "name": "山西煤炭运销集团和顺运通煤业有限公司", 
        "lat": "37.360324"
    }, 
    {
        "lnt": "113.541506", 
        "name": "山西和顺正邦煤业有限公司", 
        "lat": "37.330011"
    }, 
    {
        "lnt": "113.512647", 
        "name": "山西和顺隆华煤业有限责任公司", 
        "lat": "37.294593"
    }, 
    {
        "lnt": "113.670935", 
        "name": "山西煤炭运销集团和顺吕鑫煤业有限公司", 
        "lat": "37.406331"
    }, 
    {
        "lnt": "113.55151", 
        "name": "山西和顺隆华北关煤业有限公司", 
        "lat": "37.351361"
    }, 
    {
        "lnt": "113.675059", 
        "name": "山西煤炭运销集团和顺益德煤业有限公司", 
        "lat": "37.413628"
    }, 
    {
        "lnt": "113.483158", 
        "name": "山西和顺正邦神磊煤业有限公司", 
        "lat": "37.247394"
    }, 
    {
        "lnt": "113.497849", 
        "name": "山西煤炭运销集团和顺鸿润煤业有限公司", 
        "lat": "37.228756"
    },
    {
        "lnt": "112.140226", 
        "name": "山西介休鑫峪沟德隆煤业有限公司", 
        "lat": "37.057809"
    }, 
    {
        "lnt": "112.140226", 
        "name": "山西介休鑫峪沟东沟煤业有限公司", 
        "lat": "37.00743405"
    }, 
    {
        "lnt": "112.143622", 
        "name": "山西介休大佛寺南窑头煤业有限公司", 
        "lat": "37.00977333"
    }, 
    {
        "lnt": "112.119069", 
        "name": "山西介休鑫峪沟煤业有限公司", 
        "lat": "37.064866823"
    }, 
    {
        "lnt": "111.785923", 
        "name": "山西介休大佛寺煤业有限公司", 
        "lat": "36.972233431"
    }, 
    {
        "lnt": "111.798007", 
        "name": "山西介休大佛寺桃园煤业有限公司", 
        "lat": "36.984983348"
    }, 
    {
        "lnt": "111.791445", 
        "name": "山西介休大佛寺小尾沟煤业有限公司", 
        "lat": "36.960470177"
    }, 
    {
        "lnt": "112.101594", 
        "name": "山西介休大佛寺旺源煤业有限公司", 
        "lat": "37.042614"
    }, 
    {
        "lnt": "112.169318", 
        "name": "山西兴盛鸿发煤业有限公司", 
        "lat": "37.068664"
    }, 
    {
        "lnt": "112.10341", 
        "name": "山西介休义棠青云煤业有限公司", 
        "lat": "37.050048117"
    }, 
    {
        "lnt": "111.80579", 
        "name": "山西介休义棠安益煤业有限公司", 
        "lat": "36.994319"
    },
    {
        "lnt": "111.566356", 
        "name": "山西灵石红杏旺盛煤业有限公司", 
        "lat": "36.930674"
    }, 
    {
        "lnt": "111.629033", 
        "name": "山西灵石银源兴庆煤业有限公司", 
        "lat": "36.907563"
    }, 
    {
        "lnt": "111.595873", 
        "name": "山西灵石华瀛孙义煤业有限公司", 
        "lat": "36.944942"
    }, 
    {
        "lnt": "111.594018", 
        "name": "山西保利金庄煤业有限公司", 
        "lat": "36.906574"
    }, 
    {
        "lnt": "111.623826", 
        "name": "山西煤炭运销集团夏门煤业有限公司", 
        "lat": "36.894208"
    }, 
    {
        "lnt": "111.661605", 
        "name": "山西灵石国泰红岩煤业有限公司", 
        "lat": "36.84495"
    }, 
    {
        "lnt": "111.639553", 
        "name": "山西灵石红杏鑫东煤业有限公司", 
        "lat": "36.850279"
    }, 
    {
        "lnt": "111.681026", 
        "name": "山西灵石银源新生煤业有限公司", 
        "lat": "36.892456"
    }, 
    {
        "lnt": "111.697591", 
        "name": "山西灵石华瀛柏沟煤业有限公司", 
        "lat": "36.900025"
    }, 
    {
        "lnt": "111.656901", 
        "name": "山西灵石昕益旺岭煤业有限公司", 
        "lat": "36.934594"
    }, 
    {
        "lnt": "111.641048", 
        "name": "山西灵石银源华强煤业有限公司", 
        "lat": "36.933541"
    }, 
    {
        "lnt": "111.665355", 
        "name": "山西灵石银源新安发煤业有限公司", 
        "lat": "36.891697"
    }, 
    {
        "lnt": "111.667266", 
        "name": "山西灵石红杏广进宝煤业有限公司", 
        "lat": "36.909866"
    }, 
    {
        "lnt": "111.62933", 
        "name": "山西梅园华盛能源开发有限公司", 
        "lat": "36.718797"
    }, 
    {
        "lnt": "111.646876", 
        "name": "山西梅园许村煤业有限公司", 
        "lat": "36.697416"
    }, 
    {
        "lnt": "111.844539", 
        "name": "山西灵石国泰南河煤业有限公司", 
        "lat": "36.728825"
    }, 
    {
        "lnt": "111.757566", 
        "name": "山西灵石梗阳煤业有限公司", 
        "lat": "36.737519"
    }, 
    {
        "lnt": "111.752292", 
        "name": "山西灵石红杏鑫鼎泰煤业有限公司", 
        "lat": "36.723279"
    }, 
    {
        "lnt": "111.589853", 
        "name": "山西灵石红杏元富煤业有限公司", 
        "lat": "36.753188"
    }, 
    {
        "lnt": "111.483571", 
        "name": "山西煤炭运销集团灵石恒岳煤业公司", 
        "lat": "36.82112"
    }, 
    {
        "lnt": "111.55195", 
        "name": "山西灵石国泰宝华煤业有限公司", 
        "lat": "36.753241"
    }, 
    {
        "lnt": "111.548656", 
        "name": "山西灵石天聚富源煤业有限公司", 
        "lat": "36.811415"
    }, 
    {
        "lnt": "111.560235", 
        "name": "山西保利长虹新建煤业有限公司", 
        "lat": "36.896541"
    }, 
    {
        "lnt": "111.590884", 
        "name": "山西灵石天聚鑫源煤业有限公司", 
        "lat": "36.868231"
    }, 
    {
        "lnt": "111.570884", 
        "name": "山西灵石亨元顺煤业有限公司", 
        "lat": "36.814385"
    }, 
    {
        "lnt": "111.822917", 
        "name": "山西灵石华瀛集广煤业有限公司", 
        "lat": "36.909269"
    }, 
    {
        "lnt": "111.807156", 
        "name": "山西省晋中灵石煤矿有限公司", 
        "lat": "36.896388"
    }, 
    {
        "lnt": "111.813376", 
        "name": "山西灵石昕益天悦煤业有限公司", 
        "lat": "36.831025"
    }, 
    {
        "lnt": "111.82714", 
        "name": "山西灵石华瀛冯家坛煤业有限公司", 
        "lat": "36.830688"
    }, 
    {
        "lnt": "111.775199", 
        "name": "山西灵石华瀛荡荡岭煤业有限公司", 
        "lat": "36.801283"
    }, 
    {
        "lnt": "111.794928", 
        "name": "山西灵石银源安苑煤业有限公司", 
        "lat": "36.920353"
    }, 
    {
        "lnt": "111.758779", 
        "name": "山西保利铁新煤业有限公司", 
        "lat": "36.936498"
    }, 
    {
        "lnt": "111.791465", 
        "name": "山西灵石国泰鸿利煤业有限公司", 
        "lat": "36.752624"
    }, 
    {
        "lnt": "111.732506", 
        "name": "山西灵石华瀛金泰源煤业有限公司", 
        "lat": "36.885508"
    }, 
     {
        "lnt": "112.246352", 
        "name": "山西平遥峰岩煤焦集团明子煤业有限公司", 
        "lat": "37.011869"
    }, 
    {
        "lnt": "112.190881", 
        "name": "山西平遥峰岩煤焦集团二亩沟煤业有限公司", 
        "lat": "37.024887"
    }, 
    {
        "lnt": "112.197932", 
        "name": "山西平遥县兴盛佛殿沟煤业有限公司", 
        "lat": "37.067127"
    }, 
    {
        "lnt": "112.207258", 
        "name": "山西平遥县兴盛煤化有限责任公司温家沟煤矿", 
        "lat": "37.073796"
    }, 
    {
        "lnt": "112.210915", 
        "name": "山西平遥县兴盛煤化有限责任公司木家庄煤矿", 
        "lat": "37.023272"
    }, 
    {
        "lnt": "112.169725", 
        "name": "山西平遥县兴盛金众煤业有限公司", 
        "lat": "37.015051"
    },
    {
        "lnt": "113.070912", 
        "name": "山西寿阳段王集团平安煤业有限公司", 
        "lat": "37.958258"
    }, 
    {
        "lnt": "113.139325", 
        "name": "山西寿阳段王集团友众煤业有限公司", 
        "lat": "37.982029"
    }, 
    {
        "lnt": "113.170053", 
        "name": "山西煤炭运销集团寿阳亨元煤业有限公司", 
        "lat": "37.980465"
    }, 
    {
        "lnt": "113.218372", 
        "name": "山西煤炭运销集团寿阳富东煤业有限公司", 
        "lat": "38.017718"
    },
    {
        "lnt": "113.72295", 
        "name": "山西昔阳安顺北坪煤业有限公司1", 
        "lat": "37.669085"
    }, 
    {
        "lnt": "111.5778", 
        "name": "山西灵石天聚鑫源煤业有限公司1", 
        "lat": "36.872302"
    }, 
    {
        "lnt": "111.585699", 
        "name": "山西灵石天聚鑫源煤业有限公司2", 
        "lat": "36.886233"
    }, 
    {
        "lnt": "111.712285", 
        "name": "灵北煤矿", 
        "lat": "36.9424"
    }, 
    {
        "lnt": "111.837445", 
        "name": "水峪矿", 
        "lat": "36.83843"
    },
    {
        "lnt": "112.756197", 
        "name": "山西榆次北山煤业有限公司", 
        "lat": "37.840461"
    }, 
    {
        "lnt": "112.750107", 
        "name": "山西榆次北山兴安煤业有限公司", 
        "lat": "37.831549"
    }, 
    {
        "lnt": "112.729771", 
        "name": "山西榆次北山坤源煤业有限公司", 
        "lat": "37.819646"
    }, 
    {
        "lnt": "112.753894", 
        "name": "山西榆次官窑煤业有限公司", 
        "lat": "37.864806"
    }, 
    {
        "lnt": "112.788196", 
        "name": "山西榆次官窑永安煤业有限公司", 
        "lat": "37.849251"
    }, 
    {
        "lnt": "112.716307", 
        "name": "山西榆次官窑瑞昇煤业有限公司", 
        "lat": "37.81865"
    }, 
    {
        "lnt": "112.809149", 
        "name": "山西煤炭运销集团晋中紫金煤业有限公司", 
        "lat": "37.864791"
    }, 
    {
        "lnt": "112.820657", 
        "name": "山西煤炭运销集团晋中紫金煤业有限公司储煤场", 
        "lat": "37.856944"
    }, 
    {
        "lnt": "112.686657", 
        "name": "山西榆次官窑安源煤业有限公司", 
        "lat": "37.807464"
    },
     {
        "lnt": "113.38756", 
        "name": "山西煤炭进出口集团左权鑫顺煤业有限公司", 
        "lat": "37.113814"
    }, 
    {
        "lnt": "113.446143", 
        "name": "山西煤炭进出口集团左权宏远煤业有限公司", 
        "lat": "37.203516"
    },
    {
        "lnt": "111.68369", 
        "name": "中国国电集团公司霍州发电厂", 
        "lat": "36.516281"
    }, 
    {
        "lnt": "111.69537", 
        "name": "山西兆光发电有限责任公司", 
        "lat": "36.552603"
    }, 
    {
        "lnt": "111.713135", 
        "name": "霍州煤矸石热电厂", 
        "lat": "36.602393"
    }, 
    {
        "lnt": "111.485254", 
        "name": "山西大唐国际临汾热电有限责任公司", 
        "lat": "36.154599"
    }, 
    {
        "lnt": "111.3985", 
        "name": "山西临汾热电有限责任公司", 
        "lat": "36.085404"
    }, 
    {
        "lnt": "111.400022", 
        "name": "漳泽电力临汾热电有限公司", 
        "lat": "36.086896"
    }, 
    {
        "lnt": "111.376428", 
        "name": "山西漳泽电力侯马热电分公司", 
        "lat": "35.590571"
    }, 
    {
        "lnt": "111.368604", 
        "name": "侯马发电厂", 
        "lat": "35.607631"
    },
    {
        "lnt": "111.916488", 
        "name": "古县煤炭运销公司", 
        "lat": "36.269706"
    }, 
    {
        "lnt": "111.111694", 
        "name": "山西煤炭运销集团临汾蒲县有限公司", 
        "lat": "36.390898"
    }, 
    {
        "lnt": "111.700829", 
        "name": "洪洞县龙鑫焦化有限责任公司赵城发运站", 
        "lat": "36.365124"
    }, 
    {
        "lnt": "111.700491", 
        "name": "山西三维集团股份有限公司", 
        "lat": "36.372689"
    }, 
    {
        "lnt": "111.691059", 
        "name": "山西煤炭运销集团临汾洪洞有限公司", 
        "lat": "36.393019"
    }, 
    {
        "lnt": "111.657266", 
        "name": "山西省国新能源发展集团恒源煤炭有限公司", 
        "lat": "36.257207"
    }, 
    {
        "lnt": "111.659638", 
        "name": "山西恒富煤化集团有限公司铁路发运站", 
        "lat": "36.262149"
    }, 
    {
        "lnt": "111.705696", 
        "name": "霍州发运站", 
        "lat": "36.48483"
    }, 
    {
        "lnt": "111.702562", 
        "name": "临汾地区煤炭运销公司圣佛发煤站", 
        "lat": "36.552358"
    }, 
    {
        "lnt": "111.715391", 
        "name": "霍州煤炭工业公司三合煤焦发运站", 
        "lat": "36.593902"
    }, 
    {
        "lnt": "111.723379", 
        "name": "省道323", 
        "lat": "36.233539"
    }, 
    {
        "lnt": "112.077895", 
        "name": "第安线", 
        "lat": "36.544545"
    }, 
    {
        "lnt": "111.26297", 
        "name": "省道329", 
        "lat": "36.284773"
    }, 
    {
        "lnt": "111.293618", 
        "name": "赵克路", 
        "lat": "36.571972"
    }, 
    {
        "lnt": "111.656101", 
        "name": "国道108", 
        "lat": "36.41513"
    }, 
    {
        "lnt": "111.573752", 
        "name": "洪洞甘亭收费站", 
        "lat": "36.151822"
    }, 
    {
        "lnt": "111.655921", 
        "name": "赵克路", 
        "lat": "36.411829"
    }, 
    {
        "lnt": "111.531146", 
        "name": "洪乔线", 
        "lat": "36.343732"
    }, 
    {
        "lnt": "110.791856", 
        "name": "国道209", 
        "lat": "35.945028"
    }, 
    {
        "lnt": "110.793091", 
        "name": "省道342", 
        "lat": "35.948355"
    }, 
    {
        "lnt": "111.196137", 
        "name": "省道233", 
        "lat": "36.047526"
    }, 
    {
        "lnt": "111.705012", 
        "name": "国道108", 
        "lat": "36.580357"
    }, 
    {
        "lnt": "111.381944", 
        "name": "交通枢纽", 
        "lat": "35.670107"
    }, 
    {
        "lnt": "112.187735", 
        "name": "第安线与唐沁线交汇处", 
        "lat": "36.367464"
    }, 
    {
        "lnt": "112.158432", 
        "name": "第安线与932乡道交汇处", 
        "lat": "36.425483"
    }, 
     {
        "lnt": "111.955603", 
        "name": "山西煤炭运销集团临汾古县有限公司", 
        "lat": "36.322557"
    }, 
    {
        "lnt": "111.969263", 
        "name": "古县晋豫焦化有限责任公司", 
        "lat": "36.338171"
    }, 
    {
        "lnt": "111.934124", 
        "name": "山西正泰煤气化有限公司", 
        "lat": "36.290037"
    }, 
    {
        "lnt": "111.979726", 
        "name": "山西省古县利达焦化有限公司", 
        "lat": "36.343977"
    }, 
    {
        "lnt": "111.126832", 
        "name": "蒲县祥瑞煤焦化有限公司", 
        "lat": "36.27768"
    }, 
    {
        "lnt": "111.691134", 
        "name": "洪洞县龙鑫焦化有限责任公司", 
        "lat": "36.37232"
    }, 
    {
        "lnt": "111.708562", 
        "name": "山西三维瑞德焦化有限公司", 
        "lat": "36.364187"
    }, 
    {
        "lnt": "111.715347", 
        "name": "山西陆合集团远中焦化有限公司", 
        "lat": "36.362029"
    }, 
    {
        "lnt": "111.689807", 
        "name": "洪洞县华清煤焦化学有限公司", 
        "lat": "36.398332"
    }, 
    {
        "lnt": "110.687476", 
        "name": "山西宏强煤焦集团有限公司", 
        "lat": "35.787337"
    }, 
    {
        "lnt": "110.686797", 
        "name": "山西宏强煤焦集团焦化一厂", 
        "lat": "35.807106"
    }, 
    {
        "lnt": "111.206862", 
        "name": "山西九成焦化有限责任公司", 
        "lat": "36.052609"
    }, 
    {
        "lnt": "110.684364", 
        "name": "隆水实业集团有限公司", 
        "lat": "35.790177"
    }, 
    {
        "lnt": "111.712046", 
        "name": "霍州中冶焦化有限责任公司", 
        "lat": "36.599539"
    }, 
     {
        "lnt": "112.171222", 
        "name": "安泽县民升选煤厂", 
        "lat": "36.395913"
    }, 
    {
        "lnt": "112.166462", 
        "name": "安泽县风山选煤厂", 
        "lat": "36.398257"
    }, 
    {
        "lnt": "112.151048", 
        "name": "安泽县腾元洗煤有限责任公司", 
        "lat": "36.436145"
    }, 
    {
        "lnt": "112.167372", 
        "name": "安泽永康洗煤有限责任公司", 
        "lat": "36.394951"
    }, 
    {
        "lnt": "112.14937", 
        "name": "安泽县天一洗煤厂", 
        "lat": "36.435142"
    }, 
    {
        "lnt": "112.084174", 
        "name": "安泽岭底煤矿有限公司", 
        "lat": "36.494859"
    }, 
    {
        "lnt": "112.150211", 
        "name": "安泽县东宝洗煤厂", 
        "lat": "36.450007"
    }, 
    {
        "lnt": "112.150102", 
        "name": "山西省安泽县通祥洗煤厂", 
        "lat": "36.451461"
    }, 
    {
        "lnt": "111.636311", 
        "name": "汾西县远华洗煤厂", 
        "lat": "36.596841"
    }, 
    {
        "lnt": "111.624019", 
        "name": "汾西县洪益洗煤厂", 
        "lat": "36.627273"
    }, 
    {
        "lnt": "111.580583", 
        "name": "汾西县煤气化有限公司", 
        "lat": "36.650738"
    }, 
    {
        "lnt": "111.65726", 
        "name": "汾西县中沟洗煤厂", 
        "lat": "36.648549"
    }, 
    {
        "lnt": "111.513946", 
        "name": "汾西县通达洗煤厂", 
        "lat": "36.683038"
    }, 
    {
        "lnt": "111.583132", 
        "name": "汾西县昱强洗煤厂", 
        "lat": "36.700485"
    }, 
    {
        "lnt": "111.584291", 
        "name": "汾西县鑫鑫洗煤厂", 
        "lat": "36.697027"
    }, 
    {
        "lnt": "111.596742", 
        "name": "汾西县康达洗煤厂", 
        "lat": "36.568152"
    }, 
    {
        "lnt": "111.589106", 
        "name": "汾西县僧念镇杨树原洗煤厂", 
        "lat": "36.607698"
    }, 
    {
        "lnt": "111.652197", 
        "name": "汾西县飞龙洗煤厂", 
        "lat": "36.495111"
    }, 
     {
        "lnt": "112.054723", 
        "name": "古县古阳镇金堆村鑫鑫选煤厂", 
        "lat": "36.470003"
    }, 
    {
        "lnt": "112.126839", 
        "name": "古县鑫源选煤有限公司", 
        "lat": "36.499528"
    }, 
    {
        "lnt": "112.039469", 
        "name": "古县赢通煤业有限公司", 
        "lat": "36.452865"
    }, 
    {
        "lnt": "112.102039", 
        "name": "古县宝丰焦化有限责任公司", 
        "lat": "36.523054"
    }, 
    {
        "lnt": "112.004576", 
        "name": "古县鹏锐煤化有限公司", 
        "lat": "36.391372"
    }, 
    {
        "lnt": "111.990079", 
        "name": "古县源昌煤化有限公司", 
        "lat": "36.423591"
    }, 
     {
        "lnt": "111.643502", 
        "name": "洪洞县百通物资经销有限公司", 
        "lat": "36.295651"
    }, 
    {
        "lnt": "111.646047", 
        "name": "洪洞县运旺煤化有限公司", 
        "lat": "36.411962"
    }, 
    {
        "lnt": "111.420214", 
        "name": "洪洞县三兴煤焦有限公司", 
        "lat": "36.486748"
    }, 
    {
        "lnt": "111.659452", 
        "name": "洪洞县卫程选煤有限公司", 
        "lat": "36.41479"
    }, 
    {
        "lnt": "111.697813", 
        "name": "洪洞县赵城昭阳洗煤厂", 
        "lat": "36.349335"
    }, 
    {
        "lnt": "111.785728", 
        "name": "洪洞县端佳煤化有限公司", 
        "lat": "36.315283"
    }, 
    {
        "lnt": "111.713489", 
        "name": "洪洞县海兴选煤厂", 
        "lat": "36.310706"
    }, 
    {
        "lnt": "111.697602", 
        "name": "洪洞县远华洗煤厂", 
        "lat": "36.351162"
    }, 
    {
        "lnt": "111.708076", 
        "name": "洪洞县永丰洗煤厂", 
        "lat": "36.35504"
    }, 
    {
        "lnt": "111.703688", 
        "name": "洪洞县赵城永青洗煤厂", 
        "lat": "36.359741"
    }, 
    {
        "lnt": "111.705778", 
        "name": "洪洞县华顺洗煤有限公司", 
        "lat": "36.361798"
    }, 
    {
        "lnt": "111.682342", 
        "name": "洪洞县鑫基福利焦化厂", 
        "lat": "36.373244"
    }, 
    {
        "lnt": "111.349223", 
        "name": "侯马市瑾驰煤炭销售有限公司", 
        "lat": "35.635532"
    }, 
    {
        "lnt": "111.344873", 
        "name": "侯马市田丰贸易有限公司", 
        "lat": "35.649559"
    }, 
    {
        "lnt": "111.718273", 
        "name": "霍州市泓源煤业有限公司", 
        "lat": "36.594654"
    }, 
    {
        "lnt": "111.678592", 
        "name": "霍州市宝峰煤业有限公司", 
        "lat": "36.606108"
    },
    {
        "lnt": "111.038584", 
        "name": "吉县昌盛煤业有限公司", 
        "lat": "36.135663"
    }, 
    {
        "lnt": "111.017974", 
        "name": "吉县鑫源洗煤厂", 
        "lat": "36.138271"
    },
     {
        "lnt": "110.916781", 
        "name": "山西乡宁焦煤集团台头煤焦有限责任公司坑口洗煤厂", 
        "lat": "36.035178"
    }, 
    {
        "lnt": "110.722601", 
        "name": "山西华宁焦煤有限责任公司坑口洗煤厂", 
        "lat": "35.818444"
    }, 
    {
        "lnt": "110.965591", 
        "name": "山西乡宁焦煤集团申南凹焦煤有限公司坑口洗煤厂", 
        "lat": "36.082741"
    }, 
    {
        "lnt": "111.025307", 
        "name": "山西乡宁焦煤集团燕家河煤业有限公司坑口洗煤厂", 
        "lat": "36.045913"
    }, 
    {
        "lnt": "111.077935", 
        "name": "山西煤炭运销集团金山煤业有限公司坑口洗煤厂", 
        "lat": "36.058493"
    }, 
    {
        "lnt": "110.688424", 
        "name": "山西中煤华晋能源有限责任公司王家岭矿坑口洗煤厂", 
        "lat": "35.703784"
    }, 
    {
        "lnt": "110.683658", 
        "name": "山西华晋韩咀焦煤有限责任公司坑口洗煤厂", 
        "lat": "35.801588"
    }, 
    {
        "lnt": "110.824661", 
        "name": "山西保利裕丰煤业有限公司坑口洗煤厂", 
        "lat": "35.88606"
    }, 
    {
        "lnt": "111.349559", 
        "name": "山西蒲县蛤蟆沟煤业有限公司坑口洗煤厂", 
        "lat": "36.410404"
    }, 
    {
        "lnt": "111.352626", 
        "name": "山西煤炭运销集团蒲县昊兴塬煤业有限公司坑口洗煤厂", 
        "lat": "36.389224"
    }, 
     {
        "lnt": "111.337556", 
        "name": "蒲县众鑫煤焦铁有限公司", 
        "lat": "36.422149"
    }, 
    {
        "lnt": "111.341712", 
        "name": "蒲县祥鑫洗煤厂", 
        "lat": "36.419831"
    }, 
    {
        "lnt": "111.322191", 
        "name": "海仓煤焦有限公司", 
        "lat": "36.561886"
    }, 
    {
        "lnt": "111.313254", 
        "name": "蒲县鑫兴煤化有限公司", 
        "lat": "36.570957"
    }, 
     {
        "lnt": "111.588901", 
        "name": "曲沃县建源洗型煤厂", 
        "lat": "35.678081"
    }, 
    {
        "lnt": "111.509745", 
        "name": "曲沃县博通煤厂", 
        "lat": "35.618372"
    }, 
    {
        "lnt": "111.488511", 
        "name": "曲沃县欣和泰煤厂", 
        "lat": "35.664589"
    }, 
    {
        "lnt": "111.499104", 
        "name": "曲沃县顺通选型煤厂", 
        "lat": "35.717168"
    }, 
    {
        "lnt": "111.486381", 
        "name": "曲沃县鑫锋工贸有限公司", 
        "lat": "35.713667"
    }, 
     {
        "lnt": "110.693158", 
        "name": "山西宏强集团宏盛选煤有限公司", 
        "lat": "35.786602"
    }, 
    {
        "lnt": "111.154883", 
        "name": "乡宁县台头镇李子坪福利洗煤厂", 
        "lat": "36.118941"
    }, 
    {
        "lnt": "110.955321", 
        "name": "乡宁呈祥洗煤有限责任公司", 
        "lat": "36.056854"
    }, 
    {
        "lnt": "110.569377", 
        "name": "乡宁县昌鑫洗煤有限公司", 
        "lat": "35.776462"
    }, 
    {
        "lnt": "111.367147", 
        "name": "临汾市昆源煤业有限责任公司", 
        "lat": "35.982829"
    }, 
    {
        "lnt": "111.366082", 
        "name": "山西豪盛洗煤有限公司", 
        "lat": "35.981048"
    }, 
    {
        "lnt": "111.311805", 
        "name": "襄汾县黎康洗煤厂", 
        "lat": "35.925185"
    }, 
    {
        "lnt": "111.310724", 
        "name": "襄汾县古城北梁焦化厂", 
        "lat": "35.925743"
    }, 
    {
        "lnt": "111.492289", 
        "name": "临汾市尧都区金泽林洗煤厂", 
        "lat": "36.216782"
    }, 
    {
        "lnt": "111.170383", 
        "name": "临汾朝阳洗煤有限公司", 
        "lat": "36.15575"
    }, 
    {
        "lnt": "111.505206", 
        "name": "临汾市地豪煤业有限公司", 
        "lat": "36.192874"
    }, 
    {
        "lnt": "111.470831", 
        "name": "临汾恒昌泰煤业有限公司", 
        "lat": "36.181897"
    }, 
    {
        "lnt": "111.757312", 
        "name": "翼城县宝腾煤业有限公司", 
        "lat": "35.649167"
    }, 
    {
        "lnt": "111.928897", 
        "name": "翼城县燎舜煤业有限责任公司", 
        "lat": "35.59273"
    }, 
    {
        "lnt": "110.604933", 
        "name": "永和县绿野牧业开发有限公司", 
        "lat": "36.790442"
    }, 
    {
        "lnt": "110.672091", 
        "name": "山西省永和县祥和储销煤场", 
        "lat": "36.816872"
    },
    {
        "lnt": "111.413805", 
        "name": "陆和集团基地安达煤业", 
        "lat": "36.45095"
    }, 
    {
        "lnt": "111.471645", 
        "name": "陆河集团常家沟煤矿", 
        "lat": "36.34503"
    },
    {
        "lnt": "111.413805", 
        "name": "陆和集团基地安达煤业", 
        "lat": "36.45095"
    }, 
    {
        "lnt": "111.471645", 
        "name": "陆河集团常家沟煤矿", 
        "lat": "36.34503"
    }, 
    {
        "lnt": "111.254944", 
        "name": "蒲县伊田煤矿", 
        "lat": "36.270665"
    }, 
    {
        "lnt": "111.95026", 
        "name": "阳煤集团翼城华泓煤业公司", 
        "lat": "35.697145"
    }, 
    {
        "lnt": "111.797036", 
        "name": "山西金晖万峰煤矿瓦斯发电厂", 
        "lat": "37.047506"
    }, 
    {
        "lnt": "111.847684", 
        "name": "山西兴安化工集团", 
        "lat": "37.090646"
    }, 
    {
        "lnt": "111.830862", 
        "name": "金晖煤焦化工有限公司电厂", 
        "lat": "37.089108"
    }, 
    {
        "lnt": "111.771303", 
        "name": "山西省孝义市金岩和嘉能源化工有限公司", 
        "lat": "37.091287"
    }, 
    {
        "lnt": "111.82169", 
        "name": "山西楼东俊安煤气化有限公司矸石发电厂", 
        "lat": "37.135171"
    }, 
    {
        "lnt": "111.847438", 
        "name": "孝义市富源金来热源有限公司", 
        "lat": "37.070639"
    }, 
    {
        "lnt": "111.882276", 
        "name": "山西信发化工有限公司电厂", 
        "lat": "37.136808"
    }, 
    {
        "lnt": "111.819858", 
        "name": "吕梁聚晟能源有限责任公司孝南发运站", 
        "lat": "37.107755"
    }, 
    {
        "lnt": "111.7685", 
        "name": "吕梁聚晟能源有限责任公司孝西发运站", 
        "lat": "37.137896"
    }, 
    {
        "lnt": "111.545453", 
        "name": "吕梁聚晟能源有限责任公司阳泉曲发运站", 
        "lat": "37.074115"
    }, 
    {
        "lnt": "111.822202", 
        "name": "孝义市孝南粮油转运站专用线", 
        "lat": "37.094863"
    }, 
    {
        "lnt": "111.73484", 
        "name": "吕梁市能源开发公司孝义市洗煤厂", 
        "lat": "37.149648"
    }, 
    {
        "lnt": "111.795524", 
        "name": "孝义市忠宝煤焦铁路发运有限公司", 
        "lat": "37.124713"
    }, 
    {
        "lnt": "111.82713", 
        "name": "山西金晖铁路运输有限公司", 
        "lat": "37.07492"
    }, 
    {
        "lnt": "111.637141", 
        "name": "岚县集运站", 
        "lat": "38.250115"
    }, 
    {
        "lnt": "111.827517", 
        "name": "孝义市集运站1", 
        "lat": "37.046468"
    }, 
    {
        "lnt": "111.529878", 
        "name": "孝义市集运站2", 
        "lat": "37.220753"
    }, 
    {
        "lnt": "111.107568", 
        "name": "兴县集运站", 
        "lat": "38.664739"
    },
    {
        "lnt": "111.822483", 
        "name": "山西城财焦化集团公司", 
        "lat": "37.139461"
    }, 
    {
        "lnt": "111.825408", 
        "name": "山西省孝义市金晖煤焦有限公司", 
        "lat": "37.089582"
    }, 
    {
        "lnt": "111.724187", 
        "name": "山西红沟煤化工有限公司", 
        "lat": "37.167986"
    }, 
    {
        "lnt": "111.13", 
        "name": "方山县金泽煤焦有限公司", 
        "lat": "37.6462"
    }, 
    {
        "lnt": "111.187894", 
        "name": "山西煤炭运销集团吕梁蓝图煤焦有限公司", 
        "lat": "37.675089"
    }, 
    {
        "lnt": "111.117491", 
        "name": "方山县德润煤焦有限公司", 
        "lat": "37.652979"
    }, 
    {
        "lnt": "111.116793", 
        "name": "吕梁全顺达煤业有限公司", 
        "lat": "37.648256"
    }, 
    {
        "lnt": "111.115825", 
        "name": "方山县鑫运煤业有限公司", 
        "lat": "37.698241"
    }, 
    {
        "lnt": "111.803176", 
        "name": "汾阳市瑞发洗煤有限公司", 
        "lat": "37.2697"
    }, 
    {
        "lnt": "111.824591", 
        "name": "汾阳市昌盛煤化有限公司", 
        "lat": "37.279204"
    }, 
    {
        "lnt": "111.825022", 
        "name": "汾阳市铁雁洗煤厂", 
        "lat": "37.258714"
    }, 
    {
        "lnt": "111.847108", 
        "name": "汾阳市兴源洗煤有限公司", 
        "lat": "37.256468"
    }, 
    {
        "lnt": "112.171092", 
        "name": "山西金桃园煤焦化有限公司", 
        "lat": "37.586885"
    }, 
    {
        "lnt": "112.19262", 
        "name": "交城县景升兴发洗煤厂", 
        "lat": "37.548545"
    }, 
    {
        "lnt": "111.896686", 
        "name": "山西古冶（集团）有限公司交城公司", 
        "lat": "37.703185"
    }, 
    {
        "lnt": "111.486495", 
        "name": "交口县双池镇玻纤煤化厂", 
        "lat": "36.959081"
    }, 
    {
        "lnt": "111.473547", 
        "name": "交口县昌恒隆煤业有限责任公司", 
        "lat": "36.953862"
    }, 
    {
        "lnt": "111.464686", 
        "name": "交口县昌霖煤化有限公司", 
        "lat": "36.981159"
    }, 
    {
        "lnt": "111.736041", 
        "name": "岚县昌升选煤有限公司", 
        "lat": "38.23294"
    }, 
    {
        "lnt": "111.597924", 
        "name": "岚县东华煤业有限公司", 
        "lat": "38.251551"
    }, 
    {
        "lnt": "111.711667", 
        "name": "岚县富原电煤有限公司", 
        "lat": "38.203424"
    }, 
    {
        "lnt": "111.79363", 
        "name": "岚县国新能源煤炭运销有限公司", 
        "lat": "38.196483"
    }, 
    {
        "lnt": "110.912313", 
        "name": "临县水源洗煤厂", 
        "lat": "37.676443"
    }, 
    {
        "lnt": "110.916035", 
        "name": "临县富承洗煤有限责任公司", 
        "lat": "37.631571"
    }, 
    {
        "lnt": "110.944531", 
        "name": "山西厚祥精煤有限公司", 
        "lat": "37.705033"
    }, 
    {
        "lnt": "110.921574", 
        "name": "柳林县晨辉洗煤有限公司", 
        "lat": "37.290391"
    }, 
    {
        "lnt": "110.895364", 
        "name": "柳林县凌志大井沟洗煤有限公司", 
        "lat": "37.516289"
    }, 
     {
        "lnt": "112.30713", 
        "name": "文水县宏鑫源煤制品有限公司", 
        "lat": "37.499809"
    }, 
    {
        "lnt": "112.254104", 
        "name": "文水县陈圣洗煤有限公司", 
        "lat": "37.508735"
    }, 
    {
        "lnt": "111.99926", 
        "name": "山西金地煤焦有限公司", 
        "lat": "37.354412"
    }, 
    {
        "lnt": "111.807339", 
        "name": "孝义市东洲煤业有限公司", 
        "lat": "37.163919"
    }, 
    {
        "lnt": "111.847022", 
        "name": "孝义市金瑞山煤业有限公司", 
        "lat": "37.044536"
    }, 
    {
        "lnt": "111.675401", 
        "name": "孝义市昌泰煤焦有限公司", 
        "lat": "37.115064"
    }, 
    {
        "lnt": "111.830115", 
        "name": "孝义市孝东煤业有限公司", 
        "lat": "37.121803"
    }, 
    {
        "lnt": "111.069703", 
        "name": "兴县起航能源有限责任公司", 
        "lat": "38.328639"
    }, 
    {
        "lnt": "111.077961", 
        "name": "兴县万润达能源有限公司", 
        "lat": "38.256661"
    }, 
    {
        "lnt": "111.066737", 
        "name": "山西隆鑫源工贸实业有限公司", 
        "lat": "38.320701"
    }, 
    {
        "lnt": "111.256786", 
        "name": "中阳县宝隆选煤有限公司", 
        "lat": "37.30465"
    }, 
    {
        "lnt": "111.054814", 
        "name": "中阳县宝源选煤有限公司", 
        "lat": "37.226887"
    }, 
     {
        "lnt": "111.109596", 
        "name": "山西方山金晖凯川煤业有限公司", 
        "lat": "37.702948"
    }, 
    {
        "lnt": "111.138375", 
        "name": "山西方山汇丰新星煤业有限公司", 
        "lat": "37.776324"
    }, 
    {
        "lnt": "111.6277417", 
        "name": "山西煤炭运销集团龙山煤业有限公司", 
        "lat": "37.23166"
    }, 
    {
        "lnt": "111.6431778", 
        "name": "山西煤炭运销集团龙峰煤业有限公司", 
        "lat": "37.212782"
    }, 
    {
        "lnt": "111.9903722", 
        "name": "山西美锦集团锦辉煤业有限公司", 
        "lat": "37.70987"
    }, 
    {
        "lnt": "111.8915667", 
        "name": "山西紫鑫矿业集团交城神宇煤业有限公司", 
        "lat": "37.718249"
    }, 
    {
        "lnt": "111.479425", 
        "name": "山西交口华润联盛梁家沟煤业有限公司", 
        "lat": "36.961704"
    }, 
    {
        "lnt": "111.5247111", 
        "name": "山西交口华润联盛孟家焉煤业有限公司", 
        "lat": "36.935805"
    }, 
     {
        "lnt": "111.719447222", 
        "name": "山西岚县昌恒煤焦有限公司", 
        "lat": "38.233876"
    }, 
    {
        "lnt": "111.702005556", 
        "name": "山西煤炭运销集团龙达煤业有限公司", 
        "lat": "38.221705"
    }, 
    {
        "lnt": "110.9725139", 
        "name": "山西省煤炭运销集团锦瑞煤业有限公司", 
        "lat": "37.696237"
    }, 
    {
        "lnt": "111.1221611", 
        "name": "山西吕梁离石永宁煤业有限公司", 
        "lat": "37.574147"
    }, 
    {
        "lnt": "111.11085", 
        "name": "山西吕梁离石金晖荣泰煤业有限公司", 
        "lat": "37.582638"
    }, 
    {
        "lnt": "110.944532", 
        "name": "锦源煤矿有限公司", 
        "lat": "37.705034"
    }, 
    {
        "lnt": "110.895739", 
        "name": "光明煤矿", 
        "lat": "37.72037"
    }, 
    {
        "lnt": "110.931061", 
        "name": "临县胜利煤焦有限责任公司", 
        "lat": "37.670449"
    }, 
    {
        "lnt": "110.953001", 
        "name": "山西柳林汇丰兴业曹家山煤业有限公司", 
        "lat": "37.37684"
    }, 
    {
        "lnt": "110.876467", 
        "name": "山西柳林鑫飞下山峁煤业有限公司", 
        "lat": "37.612191"
    }, 
    {
        "lnt": "112.135909", 
        "name": "中兴煤业", 
        "lat": "37.624874"
    }, 
    {
        "lnt": "111.441905", 
        "name": "交口县露天矿1", 
        "lat": "36.8812"
    }, 
    {
        "lnt": "111.045552", 
        "name": "山西石楼华润联盛介板沟煤业有限公司", 
        "lat": "36.986865"
    }, 
    {
        "lnt": "111.024112", 
        "name": "山西石楼华润联盛赵家沟煤业有限公司", 
        "lat": "36.929773"
    }, 
    {
        "lnt": "111.796016667", 
        "name": "山西金晖万峰煤矿有限公司", 
        "lat": "37.044569"
    }, 
    {
        "lnt": "111.075125", 
        "name": "山西吕梁中阳梗阳煤业有限公司", 
        "lat": "37.273984"
    }, 
    {
        "lnt": "111.304166", 
        "name": "山西中阳桃园南山煤业有限公司", 
        "lat": "37.264308"
    }, 
    {
        "lnt": "111.216615", 
        "name": "山西兴县金地煤业有限公司", 
        "lat": "38.268517"
    }, 
    {
        "lnt": "111.167167", 
        "name": "山西兴县华润联盛峁底煤业有限公司", 
        "lat": "38.444992"
    },
    {
        "lnt": "112.927486", 
        "name": "山西漳电国电王坪发电有限公司", 
        "lat": "39.765224"
    }, 
    {
        "lnt": "112.795393", 
        "name": "山西永皓煤矸石发电有限公司", 
        "lat": "39.613807"
    }, 
    {
        "lnt": "112.511884", 
        "name": "山西京玉发电有限责任公司", 
        "lat": "39.864856"
    }, 
    {
        "lnt": "112.324327", 
        "name": "山西平朔煤矸石发电有限责任公司", 
        "lat": "39.472695"
    }, 
    {
        "lnt": "112.299448", 
        "name": "朔州同煤万通源二铺煤炭运销有限公司", 
        "lat": "39.49236"
    }, 
    {
        "lnt": "112.300849", 
        "name": "井坪发煤站", 
        "lat": "39.517742"
    }, 
    {
        "lnt": "112.447348", 
        "name": "朔州市芦西选煤有限公司", 
        "lat": "39.453282"
    }, 
    {
        "lnt": "112.898289", 
        "name": "怀仁县佳隆旺能源有限责任公司", 
        "lat": "39.702027"
    }, 
    {
        "lnt": "112.975139", 
        "name": "怀仁万丰洗煤有限责任公司", 
        "lat": "39.660402"
    }, 
    {
        "lnt": "113.021091", 
        "name": "怀仁县运盛精煤洗选有限公司", 
        "lat": "39.750468"
    }, 
    {
        "lnt": "112.502376", 
        "name": "山西中煤杨涧煤业有限公司坑口洗煤厂", 
        "lat": "39.416572"
    }, 
    {
        "lnt": "112.478948", 
        "name": "山西朔州平鲁区龙矿大恒煤业有限公司坑口洗煤厂", 
        "lat": "39.459824"
    }, 
    {
        "lnt": "112.439455", 
        "name": "朔州市富军煤炭洗选有限责任公司", 
        "lat": "39.464107"
    }, 
    {
        "lnt": "112.435454", 
        "name": "朔州市长晟商贸有限责任公司", 
        "lat": "39.481939"
    },
    {
        "lnt": "112.829014", 
        "name": "山阴县宏业煤业有限公司", 
        "lat": "39.640633"
    }, 
    {
        "lnt": "112.782335", 
        "name": "山西煤炭运销集团朔州山阴有限公司", 
        "lat": "39.670395"
    }, 
    {
        "lnt": "112.950083", 
        "name": "山阴县昌茂煤业有限责任公司", 
        "lat": "39.456206"
    }, 
    {
        "lnt": "112.680991", 
        "name": "朔州东方长宏能源发展有限公司", 
        "lat": "39.387793"
    }, 
    {
        "lnt": "112.694963", 
        "name": "朔州市富民煤业有限公司", 
        "lat": "39.400528"
    }, 
    {
        "lnt": "112.602402", 
        "name": "朔州市美源经贸有限公司", 
        "lat": "39.375815"
    }, 
    {
        "lnt": "112.603314", 
        "name": "山西新杰能源开发有限公司", 
        "lat": "39.379984"
    }, 
    {
        "lnt": "113.035549", 
        "name": "朔州经纬通有限公司", 
        "lat": "39.61542"
    }, 
    {
        "lnt": "113.044851", 
        "name": "应县腾达煤业有限公司", 
        "lat": "39.624506"
    }, 
    {
        "lnt": "112.542256", 
        "name": "山西玉龙集团右玉洗煤有限公司", 
        "lat": "39.815803"
    }, 
    {
        "lnt": "112.622041", 
        "name": "右玉县腾盛煤业有限公司", 
        "lat": "39.735969"
    }, 
    {
        "lnt": "112.582277", 
        "name": "右玉县云杉煤炭洗选有限公司", 
        "lat": "39.802915"
    }, 
    {
        "lnt": "112.963071", 
        "name": "山西怀仁中能芦子沟煤业有限责任公司", 
        "lat": "39.818739"
    }, 
    {
        "lnt": "112.827656", 
        "name": "山西怀仁峙峰山煤业有限责任公司", 
        "lat": "39.787794"
    }, 
     {
        "lnt": "112.450422", 
        "name": "山西朔州平鲁区芦家窑煤矿有限公司", 
        "lat": "39.449437"
    }, 
    {
        "lnt": "112.450422", 
        "name": "山西朔州平鲁区国强煤业有限公司", 
        "lat": "39.455935"
    }, 
    {
        "lnt": "112.75471", 
        "name": "山西朔州山阴金海洋元宝湾煤业有限公司", 
        "lat": "39.734499"
    }, 
    {
        "lnt": "112.700291", 
        "name": "山西朔州山阴金海洋五家沟煤业有限公司", 
        "lat": "39.716207"
    }, 
    {
        "lnt": "112.334034", 
        "name": "山西中煤西沙河煤业有限公司", 
        "lat": "39.400939"
    }, 
    {
        "lnt": "112.3531", 
        "name": "山西葫芦堂煤业有限公司", 
        "lat": "39.417589"
    }, 
    {
        "lnt": "112.467843", 
        "name": "山西中煤担水沟煤业有限公司", 
        "lat": "39.407179"
    }, 
    {
        "lnt": "112.51472", 
        "name": "山西中煤杨涧煤业有限公司铁路专用线", 
        "lat": "39.410141"
    }, 
    {
        "lnt": "112.988813", 
        "name": "山西怀仁中能芦子沟煤业有限责任公司铁路专用线", 
        "lat": "39.820803"
    }, 
    {
        "lnt": "112.824927", 
        "name": "山西怀仁峙峰山煤业有限责任公司", 
        "lat": "39.787239"
    }, 
    {
        "lnt": "112.587093", 
        "name": "山西右玉玉龙煤业有限公司", 
        "lat": "39.755384"
    }, 
    {
        "lnt": "112.599629", 
        "name": "山西教场坪集团玉岭煤业有限公司", 
        "lat": "39.741861"
    },
    {
        "lnt": "112.751897", 
        "name": "忻州广宇煤电有限公司", 
        "lat": "38.460603"
    }, 
    {
        "lnt": "112.472869", 
        "name": "山西漳泽电力同华发电有限公司", 
        "lat": "38.917986"
    }, 
    {
        "lnt": "111.182005", 
        "name": "山西鲁能河曲发电有限公司", 
        "lat": "39.385519"
    }, 
    {
        "lnt": "112.721899", 
        "name": "田村发煤站", 
        "lat": "38.367498"
    }, 
    {
        "lnt": "112.742154", 
        "name": "忻州站", 
        "lat": "38.422023"
    }, 
    {
        "lnt": "112.737106", 
        "name": "忻州市煤炭集运公司", 
        "lat": "38.566544"
    }, 
    {
        "lnt": "112.379752", 
        "name": "原平市国新能源煤炭有限公司", 
        "lat": "38.844863"
    }, 
    {
        "lnt": "112.723053", 
        "name": "原平煤炭集运站", 
        "lat": "38.739191"
    }, 
    {
        "lnt": "112.747441", 
        "name": "山西云马焦化有限责任公司", 
        "lat": "38.451005"
    }, 
    {
        "lnt": "111.515049", 
        "name": "忻州鑫宇煤炭气化有限公司", 
        "lat": "38.693375"
    },
     {
        "lnt": "112.899212", 
        "name": "代县景荣煤炭有限公司", 
        "lat": "39.055895"
    }, 
    {
        "lnt": "112.876272", 
        "name": "代县春光民用储煤厂", 
        "lat": "39.059888"
    }, 
    {
        "lnt": "112.87367", 
        "name": "代县福兴民用储煤厂", 
        "lat": "39.071363"
    }, 
    {
        "lnt": "113.104081", 
        "name": "定襄县吉胜煤炭运销公司", 
        "lat": "38.613117"
    }, 
    {
        "lnt": "112.960917", 
        "name": "定襄县石化煤炭储售公司", 
        "lat": "38.480442"
    }, 
    {
        "lnt": "113.082853", 
        "name": "山西云兴科贸有限公司", 
        "lat": "38.567147"
    }, 
    {
        "lnt": "113.833959", 
        "name": "繁峙县华岳民用煤储售煤场有限公司", 
        "lat": "39.233265"
    }, 
    {
        "lnt": "113.303563", 
        "name": "繁峙县诚盛民用煤储售煤场有限公司", 
        "lat": "39.201307"
    }, 
    {
        "lnt": "113.822839", 
        "name": "山西煤炭运输集团忻州同发煤炭储配有限公司", 
        "lat": "39.23151"
    }, 
    {
        "lnt": "111.164206", 
        "name": "河曲县晋西商贸有限公司", 
        "lat": "39.153429"
    }, 
    {
        "lnt": "111.228558", 
        "name": "河曲县隆盛洗煤有限公司", 
        "lat": "39.173507"
    }, 
    {
        "lnt": "111.234059", 
        "name": "河曲县亿达洗煤有限公司", 
        "lat": "39.16503"
    }, 
    {
        "lnt": "111.164206", 
        "name": "河曲县晋西商贸有限公司", 
        "lat": "39.153429"
    }, 
    {
        "lnt": "111.228558", 
        "name": "河曲县隆盛洗煤有限公司", 
        "lat": "39.173507"
    }, 
    {
        "lnt": "111.234059", 
        "name": "河曲县亿达洗煤有限公司", 
        "lat": "39.16503"
    }, 
    {
        "lnt": "111.58303", 
        "name": "岢岚县隆鑫洗煤有限责任公司", 
        "lat": "38.788071"
    }, 
    {
        "lnt": "111.607757", 
        "name": "银河民用煤储售煤场", 
        "lat": "38.760222"
    }, 
    {
        "lnt": "111.605549", 
        "name": "岢岚县隆鑫煤业有限公司", 
        "lat": "38.759616"
    }, 
    {
        "lnt": "112.269479", 
        "name": "宁武县希荣洗煤有限责任公司", 
        "lat": "38.981619"
    }, 
    {
        "lnt": "112.432517", 
        "name": "宁武县汪铁沟储售煤有限公司", 
        "lat": "39.015925"
    }, 
    {
        "lnt": "112.273321", 
        "name": "宁武晋海洗煤有限责任公司", 
        "lat": "38.987717"
    }, 
    {
        "lnt": "111.523809", 
        "name": "偏关县广源商贸有限责任公司及偏关县长盛民用煤储售有限公司", 
        "lat": "39.399226"
    }, 
    {
        "lnt": "111.530322", 
        "name": "偏关县吉泰洗煤有限公司", 
        "lat": "39.386256"
    }, 
    {
        "lnt": "113.23728", 
        "name": "五台县兴隆民用煤储售煤场", 
        "lat": "38.70251"
    }, 
    {
        "lnt": "113.137661", 
        "name": "五台县大金源煤炭洗选有限公司", 
        "lat": "38.60731"
    }, 
    {
        "lnt": "113.212556", 
        "name": "五台三鑫源储售煤有限公司", 
        "lat": "38.780765"
    }, 
    {
        "lnt": "112.686528", 
        "name": "忻州市向阳洗煤有限公司", 
        "lat": "38.307143"
    }, 
    {
        "lnt": "112.693791", 
        "name": "忻州市忻府区新源洗煤有限责任公司", 
        "lat": "38.300892"
    }, 
    {
        "lnt": "112.603984", 
        "name": "原平市泰兴煤焦有限公司", 
        "lat": "38.802301"
    }, 
    {
        "lnt": "112.609027", 
        "name": "原平市金田煤业有限公司", 
        "lat": "38.798578"
    },
    {
        "lnt": "113.598925", 
        "name": "山西平定古州富鑫煤业有限公司", 
        "lat": "37.794561"
    }, 
    {
        "lnt": "113.638188", 
        "name": "山西平定古州伟峰煤业有限公司", 
        "lat": "37.73611111"
    }, 
    {
        "lnt": "113.60655", 
        "name": "山西平定古州冠裕煤业有限公司", 
        "lat": "37.76880278"
    }, 
    {
        "lnt": "113.349816", 
        "name": "山西煤炭运销集团保安煤业有限公司", 
        "lat": "37.87729722"
    }, 
    {
        "lnt": "113.424624", 
        "name": "山西煤炭运销集团旧街煤业有限公司", 
        "lat": "37.85349167"
    }, 
    {
        "lnt": "113.437237", 
        "name": "山西煤炭运销集团鸿泰煤业有限公司", 
        "lat": "37.82783889"
    }, 
    {
        "lnt": "113.32612", 
        "name": "阳泉市上社煤炭有限责任公司及山西煤炭运销集团盂县恒泰常顺煤业有限公司", 
        "lat": "38.01061667"
    }, 
    {
        "lnt": "113.316583", 
        "name": "山西煤炭运销集团阳泉上社晋玉煤业有限公司", 
        "lat": "38.00619722"
    }, 
    {
        "lnt": "113.304032", 
        "name": "阳泉市上社二景煤炭有限责任公司", 
        "lat": "38.001443"
    },
    {
        "lnt": "110.651943", 
        "name": "山西漳泽电力股份有限公司河津发电厂专用线", 
        "lat": "35.614016"
    }, 
    {
        "lnt": "110.792675", 
        "name": "山西曙光集运站", 
        "lat": "35.57329"
    }, 
    {
        "lnt": "110.7306", 
        "name": "米家湾煤炭集运站", 
        "lat": "35.586689"
    }, 
    {
        "lnt": "110.649542", 
        "name": "禹门口发运站", 
        "lat": "35.664504"
    }, 
    {
        "lnt": "111.663007", 
        "name": "北方铜业股份有限公司热电厂", 
        "lat": "35.319568"
    }, 
    {
        "lnt": "110.952426", 
        "name": "关铝热电有限公司煤场", 
        "lat": "34.98745"
    }, 
    {
        "lnt": "110.734005", 
        "name": "山西阳光焦化集团股份有限公司集运站2", 
        "lat": "35.58985"
    }, 
    {
        "lnt": "110.636652", 
        "name": "杜家沟发煤站", 
        "lat": "35.663677"
    }, 
    {
        "lnt": "110.648574", 
        "name": "清涧发煤站", 
        "lat": "35.642226"
    }, 
    {
        "lnt": "110.722604", 
        "name": "河津市华晟能源有限公司", 
        "lat": "35.643172"
    }, 
    {
        "lnt": "110.727829", 
        "name": "河津市津鑫焦化有限公司", 
        "lat": "35.679084"
    }, 
    {
        "lnt": "110.75811", 
        "name": "河津市永鑫实业集团有限公司", 
        "lat": "35.711809"
    }, 
    {
        "lnt": "110.628156", 
        "name": "河津市禹门口焦化厂有限公司", 
        "lat": "35.668384"
    }, 
    {
        "lnt": "110.682784", 
        "name": "兴达煤焦有限公司", 
        "lat": "35.583475"
    }, 
    {
        "lnt": "110.707692", 
        "name": "东庄选煤有限公司", 
        "lat": "35.616382"
    }, 
    {
        "lnt": "110.698646", 
        "name": "盛源选煤有限公司", 
        "lat": "35.701094"
    }, 
    {
        "lnt": "111.01344", 
        "name": "东旭工贸公司", 
        "lat": "35.681051"
    }, 
    {
        "lnt": "110.992354", 
        "name": "稷山县常林煤业有限公司", 
        "lat": "35.643704"
    }, 
    {
        "lnt": "110.968071", 
        "name": "稷山县国新能源", 
        "lat": "35.657722"
    }, 
    {
        "lnt": "111.015252", 
        "name": "稷山县恒泰焦铁有限公司", 
        "lat": "35.660983"
    }, 
    {
        "lnt": "111.009904", 
        "name": "山西稷鑫石材有限公司", 
        "lat": "35.667974"
    }, 
    {
        "lnt": "111.713328", 
        "name": "宏远煤业有限公司", 
        "lat": "35.614837"
    }, 
    {
        "lnt": "111.632855", 
        "name": "勃泰煤炭洗煤及丰泽煤炭经销有限公司", 
        "lat": "35.630131"
    }, 
    {
        "lnt": "111.639316", 
        "name": "金达铸造有限公司", 
        "lat": "35.544307"
    }, 
    {
        "lnt": "110.742284", 
        "name": "鼎盛鑫源商贸有限公司", 
        "lat": "35.118962"
    }, 
    {
        "lnt": "110.771883", 
        "name": "瑞宝煤炭销售有限公司", 
        "lat": "35.129031"
    }, 
    {
        "lnt": "110.740022", 
        "name": "威浩煤炭运销有限公司", 
        "lat": "35.120527"
    }, 
    {
        "lnt": "110.742957", 
        "name": "运通煤业有限公司", 
        "lat": "35.122304"
    }, 
    {
        "lnt": "110.744089", 
        "name": "伟业煤焦商贸有限公司", 
        "lat": "35.125002"
    }, 
    {
        "lnt": "111.216473", 
        "name": "平陆县锦泽煤业有限公司", 
        "lat": "34.821652"
    }, 
    {
        "lnt": "110.324321", 
        "name": "运城市风陵渡沁风煤炭有限公司", 
        "lat": "34.62447"
    }, 
    {
        "lnt": "110.707215", 
        "name": "运达煤炭销售有限公司", 
        "lat": "35.431212"
    }, 
    {
        "lnt": "110.705914", 
        "name": "谐德福煤焦有限公司", 
        "lat": "35.435787"
    }, 
    {
        "lnt": "110.553275", 
        "name": "田阳煤炭销售有限公司", 
        "lat": "35.351171"
    }, 
    {
        "lnt": "111.335396", 
        "name": "山西汇达煤业有限公司", 
        "lat": "35.415927"
    }, 
    {
        "lnt": "111.19078", 
        "name": "金三角燃料经销处", 
        "lat": "35.333682"
    }, 
    {
        "lnt": "111.126205", 
        "name": "铁胜实业有限公司", 
        "lat": "35.25358"
    }, 
    {
        "lnt": "111.116788", 
        "name": "鑫源煤炭销售", 
        "lat": "35.252437"
    }, 
    {
        "lnt": "111.134915", 
        "name": "恒兴物贸煤场", 
        "lat": "35.196364"
    }, 
    {
        "lnt": "111.246546", 
        "name": "新绛县晋渊洗煤有限公司", 
        "lat": "35.681808"
    }, 
    {
        "lnt": "111.11971", 
        "name": "新绛县威顿煤业有限公司", 
        "lat": "35.763524"
    }, 
    {
        "lnt": "111.238585", 
        "name": "泽源贸易有限公司", 
        "lat": "35.653613"
    }, 
    {
        "lnt": "110.868358", 
        "name": "鑫泓越物贸有限公司", 
        "lat": "34.989699"
    }, 
    {
        "lnt": "110.834023", 
        "name": "鑫万达物贸有限公司", 
        "lat": "34.950975"
    }, 
    {
        "lnt": "110.424099", 
        "name": "泓源煤炭销售有限公司", 
        "lat": "34.911716"
    }, 
    {
        "lnt": "110.422933", 
        "name": "中宇物资燃料销售有限公司", 
        "lat": "34.924003"
    }, 
    {
        "lnt": "111.759043", 
        "name": "垣曲县昊通商贸有限公司", 
        "lat": "35.184504"
    }, 
    {
        "lnt": "111.759217", 
        "name": "垣曲县舜通煤炭经销有限公司", 
        "lat": "35.196552"
    },
    {
        "lnt": "112.977398",
        "name": "山西潞安荣海发电有限责任公司",
        "lat": "36.500894"
    }, {
        "lnt": "113.046702",
        "name": "山西潞安矿业（集团）有限责任公司五阳热电厂",
        "lat": "36.487013"
    }, {
        "lnt": "113.1905",
        "name": "山西鲁晋王曲发电有限责任公司",
        "lat": "36.344676"
    }, {
        "lnt": "112.839662",
        "name": "武乡西山发电有限责任公司",
        "lat": "36.82069"
    }, {
        "lnt": "112.860271",
        "name": "山西潞安余吾热电有限公司",
        "lat": "36.360711"
    }, {
        "lnt": "113.086483",
        "name": "山西漳泽电力股份有限公司",
        "lat": "36.325863"
    }, {
        "lnt": "113.08443",
        "name": "山西漳山发电有限责任公司",
        "lat": "36.325947"
    }, {
        "lnt": "113.0122",
        "name": "晋能长治热电有限公司",
        "lat": "36.193689"
    }, {
        "lnt": "113.282048",
        "name": "天脊集团第一电厂",
        "lat": "36.321755"
    },{
        "lnt": "113.085057",
        "name": "长治市城区",
        "lat": "36.324834"
    }, {
        "lnt": "113.213542",
        "name": "壶关县工业用户1",
        "lat": "36.137904"
    }, {
        "lnt": "113.19221",
        "name": "壶关县工业用户2",
        "lat": "36.086541"
    }, {
        "lnt": "113.366742",
        "name": "黎城县工业用户",
        "lat": "36.535328"
    }, {
        "lnt": "113.147204",
        "name": "潞城市工业用户1",
        "lat": "36.379637"
    }, {
        "lnt": "113.160284",
        "name": "潞城市工业用户2",
        "lat": "36.328435"
    }, {
        "lnt": "112.544047",
        "name": "沁水县工业用户",
        "lat": "35.721857"
    }, {
        "lnt": "113.11395",
        "name": "襄垣县工业用户",
        "lat": "36.50075"
    },{
        "lnt": "113.330891",
        "name": "黎城县集运站",
        "lat": "36.465392"
    }, {
        "lnt": "113.39079",
        "name": "黎城发煤站",
        "lat": "36.517931"
    }, {
        "lnt": "113.343711",
        "name": "黎城县乡镇煤炭运销有限公司水洋发运站",
        "lat": "36.467262"
    }, {
        "lnt": "113.329573",
        "name": "山西省长治煤炭运销分公司水洋煤站",
        "lat": "36.464874"
    }, {
        "lnt": "113.289739",
        "name": "潞城市微子镇站内",
        "lat": "36.32567"
    }, {
        "lnt": "113.146603",
        "name": "潞宝战略装车点1、2道",
        "lat": "36.32785"
    }, {
        "lnt": "113.208386",
        "name": "潞城发煤站",
        "lat": "36.314946"
    }, {
        "lnt": "113.088159",
        "name": "潞城市店上煤站-1",
        "lat": "36.444315"
    }, {
        "lnt": "113.089654",
        "name": "潞城市店上煤站-2",
        "lat": "36.44019"
    }, {
        "lnt": "113.085852",
        "name": "潞城市店上站内6道",
        "lat": "36.442104"
    }, {
        "lnt": "112.747046",
        "name": "沁县魏家坡集运站",
        "lat": "36.643133"
    }, {
        "lnt": "112.705706",
        "name": "沁县发煤站",
        "lat": "36.747906"
    }, {
        "lnt": "113.299816",
        "name": "武乡县煤炭运销公司墨镫营业站",
        "lat": "36.946972"
    }, {
        "lnt": "113.275857",
        "name": "山西太岳煤炭运销有限公司墨镫发运站",
        "lat": "36.921023"
    }, {
        "lnt": "113.053926",
        "name": "山西太岳煤炭运销有限公司北社煤炭发运站",
        "lat": "36.760104"
    }, {
        "lnt": "113.049459",
        "name": "武乡县北社站内",
        "lat": "36.763364"
    }, {
        "lnt": "112.850873",
        "name": "武乡发煤站",
        "lat": "36.85134"
    }, {
        "lnt": "113.015468",
        "name": "长治县小宋站内",
        "lat": "36.127081"
    }, {
        "lnt": "113.030353",
        "name": "山西成功煤炭销售有限公司任家庄煤炭集运站",
        "lat": "36.139772"
    }, {
        "lnt": "113.053396",
        "name": "长治县煤炭集运公司郝家庄煤站-1",
        "lat": "36.169327"
    }, {
        "lnt": "113.052956",
        "name": "长治县煤炭集运公司郝家庄煤站-2",
        "lat": "36.171738"
    }, {
        "lnt": "113.108834",
        "name": "长治县王庄集运站",
        "lat": "35.97822"
    }, {
        "lnt": "113.06058",
        "name": "长治县经坊集运站",
        "lat": "36.061178"
    }, {
        "lnt": "112.923358",
        "name": "长子县东田良站内16道",
        "lat": "35.997688"
    }, {
        "lnt": "112.955216",
        "name": "长子二十道、十二道",
        "lat": "36.066063"
    }, {
        "lnt": "112.905277",
        "name": "山西煤销东田良煤炭销售有限公司（原名：庄头发煤站）",
        "lat": "35.98027"
    }, {
        "lnt": "113.065011",
        "name": "襄垣县五阳车站站内五道",
        "lat": "36.469435"
    }, {
        "lnt": "113.001066",
        "name": "山西明源兴煤炭运销有限公司（原名：襄垣县出口煤公司）",
        "lat": "36.522222"
    }, {
        "lnt": "113.009321",
        "name": "襄垣县乡镇煤运公司九七二煤站",
        "lat": "36.521233"
    }, {
        "lnt": "113.020061",
        "name": "襄垣县煤炭运销分公司襄垣煤站",
        "lat": "36.517256"
    }, {
        "lnt": "113.224642",
        "name": "壶关县煤炭运销公司集店发煤站",
        "lat": "36.15011"
    }, {
        "lnt": "112.398348",
        "name": "山西武沁铁路有限公司沁沁铁路新交口车站",
        "lat": "36.616711"
    }, {
        "lnt": "113.118234",
        "name": "长治郊区大辛庄东关站",
        "lat": "36.232018"
    }, {
        "lnt": "113.061006",
        "name": "长治车站",
        "lat": "36.186197"
    }, {
        "lnt": "113.073419",
        "name": "长治联运线",
        "lat": "36.181084"
    }, {
        "lnt": "113.061627",
        "name": "长治集运站",
        "lat": "36.184318"
    }, {
        "lnt": "113.06527",
        "name": "长治市金属材抖有限公司",
        "lat": "36.181791"
    }, {
        "lnt": "113.06725",
        "name": "长治郊区堠北庄煤站",
        "lat": "36.182072"
    }, {
        "lnt": "113.0582",
        "name": "长治市化工有限公司专用线",
        "lat": "36.178018"
    }, {
        "lnt": "113.056501",
        "name": "长治明信煤业有限公司专用线",
        "lat": "36.190407"
    }, {
        "lnt": "113.046847",
        "name": "首钢长治钢铁有限公司专用线",
        "lat": "36.358443"
    }, {
        "lnt": "113.116728",
        "name": "长治长北机务段专用线",
        "lat": "36.295879"
    }, {
        "lnt": "113.121462",
        "name": "长治长北机务段",
        "lat": "36.29465"
    }, {
        "lnt": "113.128934",
        "name": "郑州铁路局长治北战略装车点",
        "lat": "36.32481"
    }, {
        "lnt": "113.132577",
        "name": "长治郊区关村集运站",
        "lat": "36.219029"
    }, {
        "lnt": "113.096197",
        "name": "长治郊区大辛庄站",
        "lat": "36.245192"
    }, {
        "lnt": "113.071808",
        "name": "城区集运站",
        "lat": "36.182346"
    },{
        "lnt": "113.346294",
        "name": "黎城县长福煤气焦化有限公司",
        "lat": "36.478008"
    }, {
        "lnt": "113.347167",
        "name": "黎城华太煤气化有限公司",
        "lat": "36.482011"
    }, {
        "lnt": "113.120203",
        "name": "山西金通焦化有限公司",
        "lat": "36.384472"
    }, {
        "lnt": "113.080828",
        "name": "山西华宝焦化集团有限公司",
        "lat": "36.438813"
    }, {
        "lnt": "113.034034",
        "name": "山西潞安焦化有限责任公司一分厂（原名：潞城市隆源焦化有限公司）",
        "lat": "36.450883"
    }, {
        "lnt": "113.106746",
        "name": "山西潞安环能煤焦化有限公司",
        "lat": "36.452695"
    }, {
        "lnt": "113.050516",
        "name": "山西潞安焦化有限责任公司",
        "lat": "36.45208"
    }, {
        "lnt": "112.583628",
        "name": "沁县华安焦化有限公司",
        "lat": "36.710059"
    }, {
        "lnt": "113.219948",
        "name": "武乡县泰昌焦化有限公司",
        "lat": "36.877962"
    }, {
        "lnt": "113.046902",
        "name": "山西潞安环能五阳弘峰焦化有限公司",
        "lat": "36.457439"
    }, {
        "lnt": "112.961787",
        "name": "襄垣县鸿达煤化有限公司",
        "lat": "36.496856"
    }, {
        "lnt": "112.950811",
        "name": "襄垣县恒祥焦化有限公司",
        "lat": "36.480034"
    }, {
        "lnt": "113.234372",
        "name": "山西常平集团实业有限公司",
        "lat": "36.136334"
    }, {
        "lnt": "112.252586",
        "name": "沁源县兴茂煤化有限公司",
        "lat": "36.753062"
    }, {
        "lnt": "112.34089",
        "name": "沁源县常源焦化有限公司",
        "lat": "36.42385"
    }, {
        "lnt": "112.325103",
        "name": "山西明源能源集团有限公司",
        "lat": "36.671212"
    }, {
        "lnt": "112.249253",
        "name": "山西沁新能源集团股份有限公司",
        "lat": "36.555856"
    }, {
        "lnt": "112.904543",
        "name": "山西尔安焦化集团有限责任公司",
        "lat": "36.357043"
    }, {
        "lnt": "112.998642",
        "name": "山西潞安华亿世纪焦化有限公司",
        "lat": "36.367034"
    }, {
        "lnt": "112.923219",
        "name": "山西潞安祥瑞焦化有限公司",
        "lat": "36.357292"
    }, {
        "lnt": "113.012372",
        "name": "山西兴旺煤化集团有限责任公司",
        "lat": "36.372556"
    }, {
        "lnt": "112.922789",
        "name": "山西潞安羿神能源股份有限责任公司",
        "lat": "36.358967"
    }, {
        "lnt": "113.022755",
        "name": "山西南耀集团昌晋源有限公司",
        "lat": "36.395084"
    }, {
        "lnt": "113.089721",
        "name": "长治市晋鑫煤焦化有限责任公司",
        "lat": "36.40671"
    }, {
        "lnt": "113.013463",
        "name": "长治市郊区南村煤化有限公司",
        "lat": "36.398047"
    }, {
        "lnt": "113.065561",
        "name": "长钢瑞达焦业有限公司",
        "lat": "36.354401"
    }, {
        "lnt": "113.03847",
        "name": "长治市劲牛焦化有限公司",
        "lat": "36.333548"
    }, {
        "lnt": "113.105674",
        "name": "长治市长源焦化有限公司",
        "lat": "36.325518"
    }, {
        "lnt": "113.105405",
        "name": "长治煤气化总公司气源厂",
        "lat": "36.329873"
    },{
        "lnt": "113.185322",
        "name": "壶关县百尺镇五谷山储煤有限公司",
        "lat": "35.956879"
    }, {
        "lnt": "113.192297",
        "name": "壶关县旭东煤场有限公司",
        "lat": "35.920832"
    }, {
        "lnt": "113.329259",
        "name": "长治市弘鑫泰工贸有限公司",
        "lat": "35.903983"
    },{
        "lnt": "113.407618",
        "name": "黎城富鑫商贸有限公司",
        "lat": "36.524845"
    },{
        "lnt": "113.277578",
        "name": "武乡墨镫华友福利洗煤有限公司",
        "lat": "36.918526"
    }, {
        "lnt": "113.250552",
        "name": "武乡县荣华洗煤有限公司",
        "lat": "36.890932"
    }, {
        "lnt": "113.219404",
        "name": "武乡县昌泰洗煤有限公司",
        "lat": "36.875909"
    }, {
        "lnt": "113.191817",
        "name": "武乡县荣辉选煤有限公司",
        "lat": "36.817092"
    }, {
        "lnt": "113.16191",
        "name": "武乡县焱鑫洗煤有限公司",
        "lat": "36.817377"
    }, {
        "lnt": "113.10152",
        "name": "山西省武乡县王家峪选煤有限公司",
        "lat": "36.738405"
    }, {
        "lnt": "113.135384",
        "name": "武乡县泰鑫洗煤有限公司",
        "lat": "36.789674"
    }, {
        "lnt": "113.099874",
        "name": "武乡县四通煤业有限责任公司",
        "lat": "36.748359"
    },{
        "lnt": "113.407618",
        "name": "黎城富鑫商贸有限公司",
        "lat": "36.524845"
    },{
        "lnt": "112.992243",
        "name": "潞城市兴业煤化有限公司",
        "lat": "36.437934"
    }, {
        "lnt": "113.288685",
        "name": "潞城市华瑞选煤有限公司",
        "lat": "36.344273"
    }, {
        "lnt": "113.294219",
        "name": "潞城市得利洗煤有限公司",
        "lat": "36.341738"
    }, {
        "lnt": "113.308399",
        "name": "潞城市华能煤产业有限公司",
        "lat": "36.371147"
    }, {
        "lnt": "113.31102",
        "name": "潞城市宏飞洗煤有限公司",
        "lat": "36.371577"
    }, {
        "lnt": "113.147129",
        "name": "潞城市鑫林煤业有限责任公司",
        "lat": "36.379701"
    }, {
        "lnt": "113.089191",
        "name": "潞城市华烽洗选煤有限公司",
        "lat": "36.400945"
    }, {
        "lnt": "113.066783",
        "name": "潞城市同兴洗煤有限公司",
        "lat": "36.389795"
    }, {
        "lnt": "113.067948",
        "name": "潞城市鑫星煤焦有限公司",
        "lat": "36.379938"
    }, {
        "lnt": "113.068871",
        "name": "潞城市晋通喷吹煤有限责任公司",
        "lat": "36.379137"
    }, {
        "lnt": "113.090412",
        "name": "潞城市鑫发煤业有限公司",
        "lat": "36.42194"
    }, {
        "lnt": "113.092673",
        "name": "潞城市新宏宝洗煤有限公司",
        "lat": "36.423798"
    }, {
        "lnt": "113.090851",
        "name": "潞城市聚鑫煤业有限公司",
        "lat": "36.424722"
    }, {
        "lnt": "113.111738",
        "name": "潞城市宏宝煤业有限公司",
        "lat": "36.427642"
    }, {
        "lnt": "113.110365",
        "name": "潞城市海兴洗喷煤有限公司",
        "lat": "36.431742"
    }, {
        "lnt": "113.10923",
        "name": "潞城市新盛选煤有限公司",
        "lat": "36.432872"
    }, {
        "lnt": "113.104875",
        "name": "潞城市新惠智煤业有限责任公司",
        "lat": "36.42628"
    }, {
        "lnt": "113.061724",
        "name": "潞城市顺丰工贸有限公司",
        "lat": "36.443687"
    }, {
        "lnt": "113.065349",
        "name": "潞城市红升洗喷煤有限公司",
        "lat": "36.438619"
    }, {
        "lnt": "113.057348",
        "name": "潞城市兴旺洗喷煤有限公司",
        "lat": "36.443614"
    }, {
        "lnt": "113.013412",
        "name": "山西潞安华亿宏通煤化有限公司",
        "lat": "36.433101"
    }, {
        "lnt": "113.039983",
        "name": "潞城市金泽洗煤有限公司",
        "lat": "36.43244"
    }, {
        "lnt": "113.106126",
        "name": "山西潞宝集团天地精煤有限公司",
        "lat": "36.458217"
    }, {
        "lnt": "113.271355",
        "name": "山西潞圣选煤有限责任公司及山西金达集团微子镇煤炭集运站",
        "lat": "36.323068"
    },{
        "lnt": "112.719049",
        "name": "山西永发煤焦销售有限公司",
        "lat": "36.698909"
    }, {
        "lnt": "112.234488",
        "name": "沁源县鑫益煤业有限公司",
        "lat": "36.762345"
    }, {
        "lnt": "112.183564",
        "name": "沁源县宏远煤业有限公司",
        "lat": "36.886703"
    }, {
        "lnt": "112.169287",
        "name": "沁源县灵空山镇伟通洗煤焦化厂",
        "lat": "36.544043"
    }, {
        "lnt": "112.249464",
        "name": "山西通洲煤焦集团股份有限公司",
        "lat": "36.740726"
    }, {
        "lnt": "112.190501",
        "name": "山西沁新能源集团股份有限公司选煤厂",
        "lat": "36.574557"
    }, {
        "lnt": "112.904652",
        "name": "屯留县尔安安龙洗煤有限公司",
        "lat": "36.357033"
    }, {
        "lnt": "113.009715",
        "name": "山西鑫丰腾达选煤有限公司",
        "lat": "36.381613"
    }, {
        "lnt": "113.022567",
        "name": "屯留县大昌煤化有限公司",
        "lat": "36.361038"
    }, {
        "lnt": "113.015928",
        "name": "屯留县华诚洗煤有限责任公司及屯留县华诚焦化有限责任公司",
        "lat": "36.372532"
    }, {
        "lnt": "113.012314",
        "name": "屯留县嘉源工贸有限公司",
        "lat": "36.298069"
    }, {
        "lnt": "113.008154",
        "name": "屯留县金丰洗煤有限公司",
        "lat": "36.387984"
    }, {
        "lnt": "112.995666",
        "name": "屯留县同兴洗煤有限公司",
        "lat": "36.31584"
    }, {
        "lnt": "112.925936",
        "name": "屯留县祥瑞洗煤有限公司",
        "lat": "36.35413"
    }, {
        "lnt": "112.989001",
        "name": "屯留县鑫泽洗煤有限公司",
        "lat": "36.352568"
    }, {
        "lnt": "113.013638",
        "name": "屯留县振兴储煤场",
        "lat": "36.337118"
    }, {
        "lnt": "113.06749",
        "name": "襄垣县宏鲁洗选煤有限公司",
        "lat": "36.48971"
    }, {
        "lnt": "113.062049",
        "name": "襄垣县远腾选煤有限公司",
        "lat": "36.490429"
    }, {
        "lnt": "113.149949",
        "name": "襄垣县海浪洗选煤有限责任公司",
        "lat": "36.482681"
    }, {
        "lnt": "113.060266",
        "name": "襄垣县恒兴洗煤有限公司",
        "lat": "36.466717"
    }, {
        "lnt": "112.977888",
        "name": "襄垣县金海煤业有限公司",
        "lat": "36.429002"
    }, {
        "lnt": "113.012043",
        "name": "襄垣县鸿盛洗选煤有限公司",
        "lat": "36.425833"
    }, {
        "lnt": "112.987434",
        "name": "山西国资华泰侯堡洗煤厂",
        "lat": "36.440486"
    }, {
        "lnt": "113.034422",
        "name": "襄垣县绿波环能洗煤有限公司",
        "lat": "36.502267"
    }, {
        "lnt": "112.996696",
        "name": "襄垣县恒固源选煤有限公司",
        "lat": "36.523146"
    }, {
        "lnt": "113.012824",
        "name": "襄垣县诚信煤业有限公司",
        "lat": "36.427399"
    }, {
        "lnt": "113.037724",
        "name": "襄垣县恒宝煤业有限公司",
        "lat": "36.470953"
    }, {
        "lnt": "113.036013",
        "name": "襄垣县隆源洗煤有限公司",
        "lat": "36.475075"
    }, {
        "lnt": "112.987584",
        "name": "襄垣县盛源煤业有限公司",
        "lat": "36.520251"
    }, {
        "lnt": "112.875199",
        "name": "襄垣县盛翔煤业有限公司",
        "lat": "36.525335"
    }, {
        "lnt": "113.011399",
        "name": "襄垣县海欣选煤有限责任公司",
        "lat": "36.639197"
    }, {
        "lnt": "113.061791",
        "name": "襄垣县晋阳煤业有限责任公司",
        "lat": "36.661664"
    }, {
        "lnt": "113.03452",
        "name": "襄垣县上良洗选煤有限公司",
        "lat": "36.669619"
    }, {
        "lnt": "113.001876",
        "name": "襄垣县广益洗选煤有限公司",
        "lat": "36.609381"
    }, {
        "lnt": "112.987137",
        "name": "襄垣县鑫芳洗煤有限责任公司",
        "lat": "36.576357"
    }, {
        "lnt": "112.9798",
        "name": "襄垣县七一恒丰洗选煤有限公司",
        "lat": "36.588502"
    }, {
        "lnt": "112.973469",
        "name": "襄垣县华洋煤业有限公司",
        "lat": "36.549419"
    }, {
        "lnt": "112.961085",
        "name": "襄垣县宏涛洗选煤有限公司",
        "lat": "36.537609"
    }, {
        "lnt": "113.055448",
        "name": "襄垣县海洋洗煤有限责任公司",
        "lat": "36.658634"
    }, {
        "lnt": "113.031342",
        "name": "襄垣县鸿鑫洗选煤有限公司",
        "lat": "36.655377"
    }, {
        "lnt": "113.012568",
        "name": "襄垣县垚鑫煤业有限公司",
        "lat": "36.65957"
    }, {
        "lnt": "113.007297",
        "name": "襄垣县华联洗选煤有限公司",
        "lat": "36.638874"
    }, {
        "lnt": "112.997692",
        "name": "襄垣县富德洗选煤有限公司",
        "lat": "36.584463"
    }, {
        "lnt": "112.988425",
        "name": "襄垣县晋源洗选煤有限公司",
        "lat": "36.573959"
    }, {
        "lnt": "112.981629",
        "name": "襄垣金鑫鸿申洗煤有限公司",
        "lat": "36.574896"
    }, {
        "lnt": "113.003037",
        "name": "襄垣县众源欣洗选煤有限公司",
        "lat": "36.556186"
    }, {
        "lnt": "113.013744",
        "name": "襄垣县环宇煤业有限公司",
        "lat": "36.549698"
    }, {
        "lnt": "113.049047",
        "name": "襄垣县宏钰选煤有限公司",
        "lat": "36.551393"
    }, {
        "lnt": "112.964966",
        "name": "襄垣县熠彤洗选煤有限公司",
        "lat": "36.547539"
    }, {
        "lnt": "112.942166",
        "name": "襄垣县乾元选煤有限公司",
        "lat": "36.507981"
    }, {
        "lnt": "112.974649",
        "name": "襄垣县开源洗煤有限责任公司",
        "lat": "36.500358"
    }, {
        "lnt": "112.933514",
        "name": "襄垣县莹泽煤业有限公司",
        "lat": "36.491054"
    }, {
        "lnt": "113.114137",
        "name": "长治市晋安洗煤有限公司",
        "lat": "36.36919"
    }, {
        "lnt": "113.118571",
        "name": "长治市润通选煤有限公司",
        "lat": "36.291638"
    }, {
        "lnt": "113.067496",
        "name": "长治市郊区中兴洗煤厂",
        "lat": "36.432009"
    }, {
        "lnt": "113.071479",
        "name": "长治市郊区鑫宝煤业有限公司",
        "lat": "36.426629"
    }, {
        "lnt": "113.088067",
        "name": "长治市昌山工贸有限公司",
        "lat": "36.338306"
    }, {
        "lnt": "113.076526",
        "name": "长治市长宁洗煤有限公司",
        "lat": "36.29639"
    }, {
        "lnt": "113.123045",
        "name": "长治市郊区龙杰选煤厂",
        "lat": "36.317792"
    }, {
        "lnt": "113.123668",
        "name": "长治市郊区宏运洗煤厂",
        "lat": "36.293026"
    }, {
        "lnt": "113.056674",
        "name": "长治市郊区西望煤化有限公司",
        "lat": "36.368406"
    }, {
        "lnt": "113.116407",
        "name": "长治市海发煤业经销有限公司",
        "lat": "36.250566"
    }, {
        "lnt": "113.097978",
        "name": "长治市郊区煤炭运销振兴煤运",
        "lat": "36.309603"
    }, {
        "lnt": "113.057201",
        "name": "长治市煤焦销售公司",
        "lat": "36.186891"
    }, {
        "lnt": "113.123671",
        "name": "长治市郊区龙杰选煤厂（2）",
        "lat": "36.320338"
    }, {
        "lnt": "113.077543",
        "name": "长治市郊区长景洗煤有限公司",
        "lat": "36.29186"
    }, {
        "lnt": "113.042448",
        "name": "山西三元煤业股份有限公司坑口洗煤厂",
        "lat": "36.176369"
    }, {
        "lnt": "113.017221",
        "name": "山西长治郊区三元南耀小常煤业有限公司坑口洗煤厂",
        "lat": "36.214192"
    }, {
        "lnt": "113.090748",
        "name": "山西长治王庄煤业有限责任公司坑口洗煤厂",
        "lat": "35.94494"
    }, {
        "lnt": "113.048106",
        "name": "山西省长治经坊煤业有限公司坑口洗煤厂",
        "lat": "36.061099"
    }, {
        "lnt": "112.969089",
        "name": "山西襄矿晋平煤业有限公司坑口洗煤厂",
        "lat": "36.508494"
    }, {
        "lnt": "112.979528",
        "name": "山西襄垣七一新发煤业有限公司坑口洗煤厂",
        "lat": "36.587107"
    }, {
        "lnt": "112.908398",
        "name": "山西大平煤业有限公司坑口洗煤厂",
        "lat": "36.508543"
    }, {
        "lnt": "113.295993",
        "name": "山西三元福达煤业有限公司坑口洗煤厂",
        "lat": "36.952627"
    }, {
        "lnt": "113.285428",
        "name": "山西马堡煤业有限公司坑口洗煤厂",
        "lat": "36.930046"
    }, {
        "lnt": "112.182243",
        "name": "山西沁新能源集团股份有限公司沁新煤矿坑口洗煤厂",
        "lat": "36.578717"
    }, {
        "lnt": "112.152912",
        "name": "山西康伟集团南山煤业有限公司坑口洗煤厂",
        "lat": "36.537839"
    }, {
        "lnt": "112.200418",
        "name": "山西沁源康伟森达源煤业有限公司坑口洗煤厂",
        "lat": "36.856187"
    }, {
        "lnt": "112.183645",
        "name": "山西沁源康伟李城煤业有限公司坑口洗煤厂",
        "lat": "36.614881"
    }, {
        "lnt": "112.13644",
        "name": "山西金晖隆泰煤业有限公司坑口洗煤厂",
        "lat": "36.971349"
    }, {
        "lnt": "112.184867",
        "name": "山西汾西太岳煤业股份有限公司坑口洗煤厂",
        "lat": "36.514425"
    }, {
        "lnt": "112.192012",
        "name": "山西沁源梗阳煤业有限公司坑口洗煤厂",
        "lat": "36.991617"
    }, {
        "lnt": "112.196043",
        "name": "山西沁源凤凰台煤业有限公司坑口洗煤厂",
        "lat": "36.872361"
    }, {
        "lnt": "112.971943",
        "name": "山西华晟荣煤矿有限公司坑口洗煤厂",
        "lat": "36.061244"
    }, {
        "lnt": "112.924843",
        "name": "山西霍尔辛赫煤业有限责任公司坑口洗煤厂",
        "lat": "36.103672"
    }, {
        "lnt": "112.922817",
        "name": "山西凌志达煤业有限公司坑口洗煤厂",
        "lat": "35.940607"
    }, {
        "lnt": "112.944226",
        "name": "山西三元煤业下霍煤矿坑口洗煤厂",
        "lat": "36.0332"
    }, {
        "lnt": "112.011797",
        "name": "长治市郊区储洗煤1",
        "lat": "37.198733848"
    }, {
        "lnt": "113.086685",
        "name": "长治市郊区储洗煤2",
        "lat": "36.254061"
    }, {
        "lnt": "113.051377",
        "name": "长治市郊区储洗煤3",
        "lat": "36.361816"
    }, {
        "lnt": "113.080434",
        "name": "长治市郊区储洗煤4",
        "lat": "36.268955"
    }, {
        "lnt": "113.106031",
        "name": "长治市郊区储洗煤5",
        "lat": "36.358481"
    }, {
        "lnt": "113.074133",
        "name": "长治市城区",
        "lat": "36.291917"
    }, {
        "lnt": "113.168125",
        "name": "壶关县储洗煤1",
        "lat": "35.973924"
    }, {
        "lnt": "113.198007",
        "name": "壶关县储洗煤2",
        "lat": "35.908439"
    }, {
        "lnt": "113.078774",
        "name": "潞城市储洗煤1",
        "lat": "36.415868"
    }, {
        "lnt": "113.113601",
        "name": "潞城市储洗煤2",
        "lat": "36.451032"
    }, {
        "lnt": "113.115172",
        "name": "潞城市储洗煤3",
        "lat": "36.427363"
    }, {
        "lnt": "113.396699",
        "name": "平顺县",
        "lat": "36.069958"
    }, {
        "lnt": "112.505572",
        "name": "沁水县储洗煤1",
        "lat": "35.571668"
    }, {
        "lnt": "112.173725",
        "name": "沁水县储洗煤2",
        "lat": "36.900577"
    }, {
        "lnt": "112.150701",
        "name": "沁水县储洗煤3",
        "lat": "36.579149"
    }, {
        "lnt": "112.150776",
        "name": "沁水县储洗煤4",
        "lat": "36.931426"
    }, {
        "lnt": "112.154849",
        "name": "沁水县储洗煤5",
        "lat": "36.940373"
    }, {
        "lnt": "112.15956",
        "name": "沁水县储洗煤6",
        "lat": "36.53036"
    }, {
        "lnt": "112.162014",
        "name": "沁水县储洗煤7",
        "lat": "36.53196"
    }, {
        "lnt": "112.214801",
        "name": "沁水县储洗煤8",
        "lat": "36.575423"
    }, {
        "lnt": "112.219875",
        "name": "沁水县储洗煤9",
        "lat": "36.85074"
    }, {
        "lnt": "112.368228",
        "name": "沁水县储洗煤10",
        "lat": "36.579519"
    }, {
        "lnt": "112.143744",
        "name": "沁水县储洗煤11",
        "lat": "36.994162"
    }, {
        "lnt": "112.202785",
        "name": "沁水县储洗煤12",
        "lat": "36.581972"
    }, {
        "lnt": "112.226886",
        "name": "沁水县储洗煤13",
        "lat": "36.436457"
    }, {
        "lnt": "112.25023",
        "name": "沁水县储洗煤14",
        "lat": "36.553904"
    }, {
        "lnt": "112.347682",
        "name": "沁水县储洗煤15",
        "lat": "36.545134"
    }, {
        "lnt": "112.353606",
        "name": "沁水县储洗煤16",
        "lat": "38.834968"
    }, {
        "lnt": "112.933327",
        "name": "屯留县储洗煤1",
        "lat": "36.336434"
    }, {
        "lnt": "112.937444",
        "name": "屯留县储洗煤2",
        "lat": "39.772142"
    }, {
        "lnt": "112.874228",
        "name": "屯留县储洗煤3",
        "lat": "36.340979"
    }, {
        "lnt": "112.895647",
        "name": "屯留县储洗煤4",
        "lat": "36.352155"
    }, {
        "lnt": "112.94332",
        "name": "屯留县储洗煤5",
        "lat": "36.37945"
    }, {
        "lnt": "112.983499",
        "name": "屯留县储洗煤6",
        "lat": "36.34233"
    }, {
        "lnt": "112.902571",
        "name": "屯留县储洗煤7",
        "lat": "36.272678"
    }, {
        "lnt": "113.008665",
        "name": "屯留县储洗煤8",
        "lat": "36.365487"
    }, {
        "lnt": "113.013309",
        "name": "屯留县储洗煤9",
        "lat": "36.337686"
    }, {
        "lnt": "113.022108",
        "name": "屯留县储洗煤10",
        "lat": "36.364721"
    }, {
        "lnt": "113.02626",
        "name": "屯留县储洗煤11",
        "lat": "36.341581"
    }, {
        "lnt": "113.045531",
        "name": "屯留县储洗煤12",
        "lat": "36.336281"
    }, {
        "lnt": "113.306686",
        "name": "武乡县储洗煤1",
        "lat": "36.942472"
    }, {
        "lnt": "112.802876",
        "name": "武乡县储洗煤2",
        "lat": "36.825834"
    }, {
        "lnt": "113.118782",
        "name": "武乡县储洗煤3",
        "lat": "36.77737"
    }, {
        "lnt": "113.17831",
        "name": "武乡县储洗煤4",
        "lat": "36.792297"
    }, {
        "lnt": "113.180947",
        "name": "武乡县储洗煤5",
        "lat": "36.792263"
    }, {
        "lnt": "113.10671",
        "name": "武乡县储洗煤6",
        "lat": "36.761486"
    }, {
        "lnt": "113.003257",
        "name": "襄垣县储洗煤1",
        "lat": "36.55969"
    }, {
        "lnt": "112.979074",
        "name": "襄垣县储洗煤2",
        "lat": "36.548384"
    }, {
        "lnt": "112.993868",
        "name": "襄垣县储洗煤3",
        "lat": "36.519918"
    }, {
        "lnt": "112.937816",
        "name": "襄垣县储洗煤4",
        "lat": "36.524698"
    }, {
        "lnt": "113.069407",
        "name": "长治县储洗煤1",
        "lat": "35.905429"
    }, {
        "lnt": "112.994434",
        "name": "长治县储洗煤2",
        "lat": "35.975778"
    }, {
        "lnt": "113.050542",
        "name": "长治县储洗煤3",
        "lat": "36.022266"
    }, {
        "lnt": "113.096072",
        "name": "长治县储洗煤4",
        "lat": "35.999711"
    }, {
        "lnt": "113.105401",
        "name": "长治县储洗煤5",
        "lat": "36.022341"
    }, {
        "lnt": "113.11944",
        "name": "长治县储洗煤6",
        "lat": "35.938185"
    }, {
        "lnt": "113.146271",
        "name": "长治县储洗煤7",
        "lat": "35.929362"
    }, {
        "lnt": "113.148925",
        "name": "长治县储洗煤8",
        "lat": "35.967485"
    }, {
        "lnt": "113.105227",
        "name": "长治县储洗煤9",
        "lat": "35.884664"
    }, {
        "lnt": "113.024338",
        "name": "长治县储洗煤10",
        "lat": "35.932607"
    }, {
        "lnt": "112.942232",
        "name": "长子县储洗煤1",
        "lat": "36.027008"
    }, {
        "lnt": "113.424365",
        "name": "黎城县洗储煤",
        "lat": "36.82521"
    }, {
        "lnt": "113.120946",
        "name": "长治县聚鑫源物资有限公司",
        "lat": "35.977658"
    }, {
        "lnt": "113.127289",
        "name": "长治县运鼎科工贸有限公司",
        "lat": "35.964751"
    }, {
        "lnt": "113.006372",
        "name": "长治市中盈煤业有限公司",
        "lat": "35.922864"
    }, {
        "lnt": "113.046987",
        "name": "长治县立日心煤业有限公司",
        "lat": "36.006967"
    }, {
        "lnt": "113.054716",
        "name": "长治县永丰瑞霞煤业有限公司",
        "lat": "35.897941"
    }, {
        "lnt": "113.041958",
        "name": "长治县金牛洗煤有限责任公司",
        "lat": "36.129048"
    }, {
        "lnt": "113.009313",
        "name": "长治县宏泰实业有限公司",
        "lat": "36.127735"
    }, {
        "lnt": "113.047789",
        "name": "长治县黎都洗煤有限责任公司",
        "lat": "36.068123"
    }, {
        "lnt": "113.069167",
        "name": "长治县鑫源洗煤厂",
        "lat": "35.919083"
    }, {
        "lnt": "113.069121",
        "name": "长治县鑫通洗煤有限公司",
        "lat": "35.927695"
    }, {
        "lnt": "112.982888",
        "name": "长治县森泰煤业有限公司",
        "lat": "36.060521"
    }, {
        "lnt": "112.989423",
        "name": "长治县金龙洗煤有限公司-1",
        "lat": "36.061027"
    }, {
        "lnt": "112.985599",
        "name": "长治县金龙洗煤有限公司-2",
        "lat": "36.060268"
    }, {
        "lnt": "112.989453",
        "name": "长治县昌顺洗煤有限公司",
        "lat": "36.060196"
    }, {
        "lnt": "113.127914",
        "name": "长治县隆泰普洗煤有限公司",
        "lat": "35.963466"
    }, {
        "lnt": "113.016356",
        "name": "长治县金华煤业有限公司",
        "lat": "36.135044"
    }, {
        "lnt": "113.067714",
        "name": "长治县益兴洗煤有限公司",
        "lat": "36.154089"
    }, {
        "lnt": "113.051983",
        "name": "长治县隆昌煤业有限公司",
        "lat": "36.169365"
    }, {
        "lnt": "113.040944",
        "name": "长治县隆泰洗煤有限责任公司",
        "lat": "36.072317"
    }, {
        "lnt": "113.101",
        "name": "长治县恒燃煤业有限公司",
        "lat": "35.984139"
    }, {
        "lnt": "113.103763",
        "name": "长治县久安煤业有限公司",
        "lat": "35.958916"
    }, {
        "lnt": "113.155517",
        "name": "长治县超营洗煤厂",
        "lat": "35.953094"
    }, {
        "lnt": "113.060704",
        "name": "长治县长掌洗煤有限公司",
        "lat": "35.907713"
    }, {
        "lnt": "113.028419",
        "name": "长治县融盛洗煤有限公司",
        "lat": "35.993551"
    }, {
        "lnt": "113.132022",
        "name": "长治县凯通选煤有限公司",
        "lat": "35.89496"
    }, {
        "lnt": "113.069426",
        "name": "长治县宏申洗煤有限责任公司",
        "lat": "36.102191"
    }, {
        "lnt": "113.069935",
        "name": "长治县顺发洗煤有限公司",
        "lat": "36.100158"
    }, {
        "lnt": "113.036088",
        "name": "长治县易通洗煤有限责任公司",
        "lat": "36.026344"
    }, {
        "lnt": "113.116277",
        "name": "长治县振西洗煤有限公司",
        "lat": "35.891925"
    }, {
        "lnt": "113.147444",
        "name": "长治县森润洗煤有限公司",
        "lat": "36.099337"
    }, {
        "lnt": "113.064126",
        "name": "长治县旺达洗煤厂",
        "lat": "36.061104"
    }, {
        "lnt": "113.005329",
        "name": "长治县增鑫洗煤有限责任公司",
        "lat": "36.028889"
    }, {
        "lnt": "113.019962",
        "name": "长治县顺意洗煤有限公司",
        "lat": "36.045418"
    }, {
        "lnt": "112.974355",
        "name": "长子县潞源储煤有限公司",
        "lat": "35.971876"
    }, {
        "lnt": "112.863861",
        "name": "长子县隆鑫煤炭储售有限公司",
        "lat": "36.244199"
    }, {
        "lnt": "112.968506",
        "name": "长治市榕泽矿业有限公司",
        "lat": "36.051269"
    }, {
        "lnt": "112.872068",
        "name": "长子县龙泉煤业有限公司",
        "lat": "35.971985"
    }, {
        "lnt": "112.94098",
        "name": "长子县飞达煤业有限公司",
        "lat": "35.934089"
    }, {
        "lnt": "112.921931",
        "name": "山西省长子县晋源煤业加工有限公司",
        "lat": "35.989363"
    }, {
        "lnt": "113.198472",
        "name": "山西煤炭运销集团百尺第二煤业有限公司",
        "lat": "35.947524"
    }, {
        "lnt": "113.172947",
        "name": "山西煤炭运销集团百尺第一煤业有限公司",
        "lat": "35.978006"
    }, {
        "lnt": "113.15005",
        "name": "山西煤炭运销集团黄山煤业有限公司",
        "lat": "36.006462"
    }, {
        "lnt": "113.299778",
        "name": "山西煤炭运销集团东井岭煤业有限公司",
        "lat": "35.886952"
    }, {
        "lnt": "113.210492",
        "name": "山西煤炭运销集团赵屋煤业有限公司",
        "lat": "35.89497"
    }, {
        "lnt": "113.016422",
        "name": "山西长治郊区三元南耀吉安煤业有限公司",
        "lat": "36.404626"
    }, {
        "lnt": "113.052281",
        "name": "山西长治郊区三元吉祥煤业有限公司",
        "lat": "36.367312"
    }, {
        "lnt": "113.064565",
        "name": "长治明信煤业有限公司",
        "lat": "36.193392"
    }, {
        "lnt": "112.995646",
        "name": "山西煤炭运销集团三元石窟煤业有限公司",
        "lat": "36.432051"
    }, {
        "lnt": "113.292584",
        "name": "山西煤炭运销集团三元微子镇煤业有限公司",
        "lat": "36.354134"
    }, {
        "lnt": "113.073978",
        "name": "山西煤炭运销集团三元宋村煤业有限公司",
        "lat": "36.379279"
    }, {
        "lnt": "112.137439",
        "name": "山西康伟集团孟子峪煤业有限公司",
        "lat": "36.541094"
    }, {
        "lnt": "112.28458",
        "name": "山西马军峪常信煤业有限公司",
        "lat": "36.840248"
    }, {
        "lnt": "112.253909",
        "name": "山西马军峪煤焦有限公司",
        "lat": "36.784804"
    }, {
        "lnt": "112.228176",
        "name": "山西马军峪曙光煤业有限公司",
        "lat": "36.781407"
    }, {
        "lnt": "112.179439",
        "name": "山西梅园嘉元煤业有限公司",
        "lat": "36.597351"
    }, {
        "lnt": "112.148772",
        "name": "山西沁新集团新达煤业有限公司",
        "lat": "36.551132"
    }, {
        "lnt": "112.220119",
        "name": "山西沁新能源集团股份有限公司新源煤矿",
        "lat": "36.568511"
    }, {
        "lnt": "112.160206",
        "name": "山西新超煤业有限公司",
        "lat": "36.954969"
    }, {
        "lnt": "112.180637",
        "name": "山西长沁新升煤业有限公司",
        "lat": "36.9004"
    }, {
        "lnt": "112.170069",
        "name": "山西长沁新兴煤业有限公司",
        "lat": "36.853634"
    }, {
        "lnt": "112.240294",
        "name": "山西通洲集团安达煤业有限公司",
        "lat": "36.737816"
    }, {
        "lnt": "112.22597",
        "name": "山西通洲集团晋杨煤业有限公司",
        "lat": "36.724767"
    }, {
        "lnt": "112.209356",
        "name": "山西通洲集团留神峪煤业有限公司",
        "lat": "36.592084"
    }, {
        "lnt": "112.216086",
        "name": "山西通州集团祥云煤业有限公司",
        "lat": "36.742473"
    }, {
        "lnt": "112.202545",
        "name": "山西黄土坡鑫能煤业有限公司",
        "lat": "36.82494"
    }, {
        "lnt": "112.205976",
        "name": "山西黄土坡鑫运煤业有限公司",
        "lat": "36.796103"
    }, {
        "lnt": "112.193837",
        "name": "山西通洲集团安神煤业有限公司",
        "lat": "36.596454"
    }, {
        "lnt": "113.23229",
        "name": "山西槐安煤业有限公司",
        "lat": "36.854922"
    }, {
        "lnt": "113.218491",
        "name": "山西显王煤业有限公司",
        "lat": "36.844746"
    }, {
        "lnt": "113.194049",
        "name": "山西东庄煤业有限公司",
        "lat": "36.818368"
    }, {
        "lnt": "113.262111",
        "name": "山西新村煤业有限公司",
        "lat": "36.901104"
    }, {
        "lnt": "113.089939",
        "name": "山西下合煤业有限公司",
        "lat": "36.726367"
    }, {
        "lnt": "113.100592",
        "name": "山西太行王家峪村煤业有限公司",
        "lat": "36.739744"
    }, {
        "lnt": "113.104522",
        "name": "山西王家峪煤业有限公司",
        "lat": "36.744836"
    }, {
        "lnt": "113.122888",
        "name": "山西阳辿煤业有限公司",
        "lat": "36.746263"
    }, {
        "lnt": "113.156005",
        "name": "山西庄底煤业有限公司",
        "lat": "36.76963"
    }, {
        "lnt": "113.047237",
        "name": "山西长治羊头岭永丰煤业有限公司",
        "lat": "35.89914"
    }, {
        "lnt": "112.980348",
        "name": "山西长治联盛师庄煤业有限公司",
        "lat": "35.940061"
    }, {
        "lnt": "113.045887",
        "name": "长治红兴煤业有限公司",
        "lat": "35.917289"
    }, {
        "lnt": "113.050296",
        "name": "长治新建煤业有限公司",
        "lat": "35.919242"
    }, {
        "lnt": "113.000476",
        "name": "山西长治联盛长虹煤业有限公司",
        "lat": "35.932432"
    }, {
        "lnt": "113.068136",
        "name": "山西长治红山煤业有限公司",
        "lat": "35.945557"
    }, {
        "lnt": "113.03534",
        "name": "山西长治联盛太义掌煤业有限公司",
        "lat": "35.933297"
    }, {
        "lnt": "113.007016",
        "name": "山西长治羊头岭南窑沟煤业有限公司",
        "lat": "35.946434"
    }, {
        "lnt": "112.971114",
        "name": "山西长治联盛首阳山煤业有限公司",
        "lat": "35.938549"
    }, {
        "lnt": "113.034074",
        "name": "山西长治县雄山沟里煤业有限公司",
        "lat": "35.958993"
    }, {
        "lnt": "113.014995",
        "name": "山西长治县雄山振义煤业有限公司",
        "lat": "35.947726"
    }, {
        "lnt": "113.070354",
        "name": "山西长治羊头岭东掌煤业有限公司",
        "lat": "35.895664"
    }, {
        "lnt": "113.077191",
        "name": "山西长治羊头岭红旗煤业有限公司",
        "lat": "35.956069"
    }, {
        "lnt": "113.003903",
        "name": "山西长治县雄山煤炭有限公司第五矿",
        "lat": "36.029064"
    }, {
        "lnt": "113.047017",
        "name": "山西长治县雄山常蒋煤业有限公司",
        "lat": "35.985797"
    }, {
        "lnt": "113.026138",
        "name": "山西长治县雄山辛呈煤业有限公司",
        "lat": "35.999965"
    }, {
        "lnt": "113.069747",
        "name": "长治县西山煤业有限责任公司",
        "lat": "35.994587"
    }, {
        "lnt": "113.121098",
        "name": "山西长治县振兴煤业有限公司",
        "lat": "35.891522"
    }, {
        "lnt": "113.140322",
        "name": "山西长治经坊镇里煤业有限公司",
        "lat": "36.090727"
    }, {
        "lnt": "113.102755",
        "name": "山西长治羊头岭南仙泉煤业有限公司",
        "lat": "36.027824"
    }, {
        "lnt": "113.109383",
        "name": "山西长治联盛西掌煤业有限公司",
        "lat": "35.892697"
    }, {
        "lnt": "113.174611",
        "name": "山西长治经坊庄子河煤业有限公司",
        "lat": "35.897168"
    }, {
        "lnt": "113.082434",
        "name": "山西长治羊头岭北峙峪煤业有限公司",
        "lat": "35.985266"
    }, {
        "lnt": "113.077267",
        "name": "山西长治县雄山李坊煤业有限公司",
        "lat": "35.99904"
    }, {
        "lnt": "113.073674",
        "name": "山西长治三元晋永泰煤业有限公司",
        "lat": "35.948027"
    }, {
        "lnt": "112.964274",
        "name": "山西垚志达煤业有限公司",
        "lat": "35.98595"
    }, {
        "lnt": "112.943244",
        "name": "山西反坡煤业有限责任公司",
        "lat": "35.965742"
    }, {
        "lnt": "113.131319",
        "name": "山西长治县雄山煤炭有限公司",
        "lat": "35.915967"
    }
]


export default {
    xon: function(){
        return xon
    },
    aq: function(){
        return aq
    },
    ry: function(){
        return ry
    },
    cl: function(){
        return cl
    },
    mkzb:function(){
        return mkzb
    }
}